import { useState, useEffect, useRef } from "react"

import { Scrollbar } from 'react-scrollbars-custom';
import Item from "/src/Item.jsx"

export default function ExplorerViewport({currentDir, onItemDoubleClick}) {
    var dirname = currentDir.type == "drive" ? `(${currentDir.name})` : currentDir.name;
    var itemsList = currentDir.children;

    const imgURLs = {
        folder: "/images/icons/explorer_folder.png",
        folder_selected: "/images/icons/explorer_folder_selected.png",
        gibberish: "/images/icons/explorer_folder.png",
        gibberish_selected: "/images/icons/explorer_folder_selected.png",
        trojan: "/images/icons/explorer_folder.png",
        trojan_selected: "/images/icons/explorer_folder_selected.png",
        note: "/images/icons/note_icon.png",
        note_selected: "/images/icons/note_icon_selected.png",
        jpg: "/images/icons/photo.ico",
        jpg_selected: "/images/icons/photo.ico",
        python: "/images/icons/python.png",
        python_selected : "/images/icons/python_selected.png",
        drive: "/images/icons/hard_disk_large.png",
        drive_selected: "/images/icons/hard_disk_large_selected.png"
    }

    const itemDesc = {
        folder: "File Folder",
        trojan: "trojan.exe",
        note: "NOTE File",
        drive: "Local Disk",
        python : "Python Source File",
        gibberish: "T̸̢̢͙̜̗̰̩̝̝̤̜̮̥̟̩͎̯͓̺͉̹̖͚̗̦̥̽͑̓̔̈̋͒̏̈́̆͑̈́͜͝h̶͈̥͔̬̖̮̫͎̜̺̺̘̘̥̓͊̀͌̅͂͗͝͠͝͝ȩ̷̛̛͕̖͙͕̪͌͊̊̀͌͛̒͆̈͊̆̄͑̾̍̆͌̔̏͐̾͑͗̌͑̽̓̐͑̓̽̿͌̀͒͗́͘̕̕͘͘͝ ̵̢̧̡̢̧̠͇̱̻̘̰̬̤̪̟̥̗̮͕̫̲̠̦͙̣̳͔̭̗̍͌͒̓͐̅͑̄̐̽̇̏̀̇̇̅̉̉̑̿̍͑̉̀̒̊̍̓́̽̍̎̿̇͆̀̏̋̓͗̍̃̆̓̇͆̃́͋̎͐̈́̀̿̓̚͘̚̚͘̚͜͜͝͠͠d̷͕̺̜̟̱̅̎̀͒̄̾̉͌́͒̓̉́̏̅͒̇͛̐͛̈́̌͌͑́̈́́̋̒́̈̃̍̅̃̊͌̈́̊̋̔͐̈́̏̀̎̎̈̈̌̐̀͆̔̕̚͝͝͠ȧ̷̢̛̙̩̫̹̟͉͕̹̻̱̹̺̫͙̩̩̖̖̞͉̝̖͕̼̰͇̹̝͓̦̙̠̪̮̦̱̣̆͌̒̈́̈̿̈̅́̏̄̌̈́̏͒̐̓̀͑̄̓̀̃̔͛͗͛͛̍̚͜͜͝ͅn̷̡̡̧̛̛̛̛̝̯̼͓͈̫̩͍͇̘̮͓̑̍̆̌͑̾̆͛͌́͆̀̅̑̈́͌̆̈́̀̑͋̋̓͌̾̍̇̉̽̊͛̐͗͋͌̚̚̕͘͜͝͝͝͝g̶̡̧̧̡̧̡̨̡̛̮͖̻̼̪͉͈͓̱̮̪͉̞͔̼̰͓͓̦͔͎̼̱̺̱͉̤̮͍̱͎͕̺̖̱̤̻̜̺̼͉̟̺̫͈̩̮͖̻͓̜̣̘̟͎̜̬̥͉̗̐̓͜͝ͅe̶̡̛̛͚̫̼͔͖̓̋̀̈͆̇̓̅̑̿̐̍̅͗̅́́͊̀̋̽͆͆͒̐̂͒́̓̉͑̄̚͘̚̚͠͝͝ͅr̸̢̨̨̨̡̡̡̢̡̥͇̘̳̤͖̹̼̺͔̗͔̤̜̟̖̼̫̥̱̩͕̮̰̗̩̩͕̩͔͎̻͎̼̞̯͇͙̫̞͉͎͓̤̜̼͇̾͊̀̍̓̊̈͗̀͌͊̄̀͌̓̔̈́̏̉̍̑͋͒̅͆͐͗̀̇̀̓̆̀̔̅͐͂̚͜͠͝͝͝͠͝ͅͅ ̶̛̛̛͍̯̪͔̤̲̻̬̹̭̗̼̀̀̑̉͛̆̌̔͐̾̅͛̽̎̀̿̈́̀̇̾̎̓̒̃͛̓̄̂̐́̆̓̄̏̌͗͘͝͠i̵̢̨̨̧̡̨̛̹̮͍̳̘̝͈̳̭̻̝͓͙̝̞̭̖̻̰̺͎͔̰̝̲̼̗͔̠̺̩̙̠̦̺͖͕̮͈̪̱̟̫̬̰̼̹̭͎̮̫͇̣̰͇̖͎͖̭̻͙̭͑̇͌̒̏̇̋̈̄̿̈́̆̓̔̋̈́̎͒̿͑̓̅͛̾́̆̈̆̋́̓̆̐͂͒̔̓̇́́̂͌̄͑̂͗̆̈́͗̐̈́͆̂͆̒̆́͗́́̃́͘̕͘͝͠͝ͅș̶̡̧̧̢̡̧̡̧̨̨̢̛͍̫̬͎̰̥͉̗̘̙̬̥͙̮̖͙̦̟̞̩͍̳̠͙͎̹͎̭̞̩͖̬̙̼̤̼̥̩͚̖̣͖̫͍͕̹̗̓̈́̾̌̃̍̉͑̋̓̅̾̾́̀̾͛̎͊̚͘̕͜͜͝͝͝͝ͅ ̵̛̛̛̲̒̈́̑̓͐͋̄̎͊̀͌͑͑͐͂̊̀̇̓̍͐͐͌̆̌̈́̓̊̊̋̊͛̽̈́̃̃̃̎̅̑̇̽̐̅̐̔̊́̎́͘͘̚̕̚͝͝͝͝ͅų̷̡̧̡̧̛͕͙̫͚͉̘̭͉̙̯̫̟͇͖̹̫̼͙̱̞̱̰̘̜̠̝̺̠͉͎̠̖̻̊͛̒̈́̄̃̅̀̀̓͛̌̈́̀̂͒̍̾͋̍͌̃̐͗̓̕̚͜͠ͅͅn̶̨̛͖̖̬̘͖͈̻͉̜̦̖̙̔͂͑ļ̶̡̡̧̛̛͔̯̫͉̺͓̺͎̤̦͓͉̯̖̳͖̞̼̠̲̫̯͕̟͕͔̳̺̻̻̬͚͎̲̮̫̣͇̪̤̓̓͋̆͗̈́́̀͛͐̃̽̑̇̄͛̽̃̅̒́̒̎́̏̈̄̆̿̃̌̈́͂̑̊̚̕̚̕͜͠͝͝͝͝ͅͅe̶̡̛̛͕͇͙̙͈̞̣͊̒̔̊̒̄̃̓͑̈́̈̋̀̂̉͛̆̍̐̀́̇̎̀̃́̍̒͒̿͗͘͘͜͠͝͝ͅͅą̷̧̥̩̘͕̞̞̝̻͍͇̳̥̩̯͔̞̘̪̰͖͚̙̼͂̏̔̊̄̎͌̔́͂̓̋̒̑̓̃̾͂̋̑́̾͌͋͐̀̆̈́́̅̊̋̏̽͗̓͌̉͑̂̑̇̕͜͠͠͠ͅş̶̡̡̢̫̭̝͍͔̙͇̪͔͕̲̣̣̺̠̩̟̬̥̝̯̮͈̥̟͙̲̠̗̠̥̘̮͔͕͎͎̟̭̝̰̼͔̠̪̉̾͐̀̎͑̈̿̔̌̏͆͗͐̿͐̈́̋͐̀͆͌̓̃̐͐̍͋̽͋̚͘͜͠͝͝͝͠ḣ̶̢̢̡̡̧̢̭̭͇̥̘̰̺̰̟̜̯̬̗͔̞̯̬͖͖̥̟̞̠̠̠̝̱̪̹̥̝̦͚̬͙̣̣̞͈̺̺͇̝̭͍̘̩͇̫̯̱̘͇͔̻̯̫͜ͅe̴̡̢̨̻͈̭̹̬̦̟̣̩̫̰̫͈̪̖̘̝̺͖̱̲̥̠̫̳̣̿͛̃̽͋̃͑̇̿̔̈́́͊͗͆͋̅́̇̽̽̅̋͛͌̽̓̂͒̉̅̐̋̽̑̈̆͌͆͒̅̀̒͗͂̕̕͠͠͝͝͝ď̵̢̨̢̡̨̧̡̛̛̲̥̤̬̩͇͚̮͕̟̗̣͉͖̘͙͚̘̥͈̯͉̤̣̖̙͙̭̰̬̝̜̻͉̺͎͇̱̤̪͊̈́͗̾̽̃͗́̿̇̊̄͆̾̋͂̇̊͋̄̿̊͋͑̈́̀̀͋̓̆̑̾͂̒̅̓̅̒͆͆̌̅̌̎̏̄̔̓̅͑̌̚̕͜͠͝͝ͅ ̸̨̢̢̢̢̛̛̼͎̞͍̖͉̻͓̟̠̦͇͍̯̰̙̭̩͓͉̥̥͕͍̞̻̣͖͉͙̫͚̥̳̩̫̞̹͙̟̲͚̳̤͕̲̱͉̣͇̳́̿͐̓͑͒̀̀͒͋͗̋͒̈́͐̃̀̒͑͒́̓̉̒̑͗̈̄͒̔͒̈̉̆̐́͌̈̽̌́̎̽́͆̅̉͌̈́̂͌̓̽̐͗̊́̂̈́͘̕͘͘̕͘͘͘͘͜͜͠͝ͅͅǭ̷̡̢͖̲̪̭̩͈͓̰͚̲̳̝͓̝̫̠̫̟͈͉̜̭̲̻͚̙̫̯̜̩̪̤̘͓̺͖̮̈́̆̇͌̋͊́͋̀̍̎̇̀̓̃́̈́͆̃͋͋̃̄̾́͠͠ṅ̷̨̧̨̥̣̩͕̩͓̼̤̫̠̖̣͍̘̼̜̩͓̓̈́̿̌̀̏̂͛̏́͛̾̒͐͗̏͌̑̈̂͋̒̅͑͌̽͋̏͋̍́͆͛̀̈́͊̓̅͆̑̚͘͘͘͘͠͠͝͝͠͠͠l̸̡̡̧̨̡̢̨̡̢̰͙͈̟̫͈̯̦̟̝̠̰̞̫͈̺̦̦̰͓̝̗̦̞̗͇̺̼̮̻͎͈̙̥͉͉͍̠̫͎͕̘̬̹͖̟̼͍̬͔͙̦̖̥͋̽̅̐̄́̇̈́̎͛̊͋̇̒̋̆̂̍̅͊̀̓͌̋͗̄̋͌̍̽̔̋̈́͌̆̌͒̏̈̉̓͒̍̑̔̊̎̒̈̀̒͐̍̐̚̚͜͜͠y̸̢͖͂̇̈́̇̆͌̌͊̆́̉̒͊͋̾̌́͌̃͛͆͋̇̽̊̒̎̀̽̽̽̀̏̓͌̽̐͌͒̾͂͋͐̀͂̿͊̄̀̐̋̅̆̌̒̈́̈̀́̍͘̚͘͝ ̶̡̘̗̯̰͖̱͕̭̺̞̝͔̘̹̖͉͓̞͍̗̳̰̉̈́͆́̎͋̑̌̇͆̑̀̀͛̅̋̃͑̿̾͊͊̆̾͆̈́̈́̿͂̄͛̓̊̑͗͒̄̎́̇̃̎͂͊̀̊̕̕͘͘͜͝͠͝͠͝͝͝ì̴̡̡͖͔͇͎͍̩̫̖͓̼͔͕̣̭̳̖̺̟̰̰̤͉̬̖͈͎͍̮̖̥̖͓̤͓͖͎̭̘̰̜̫̙͚̮͙͓̈́̌͐͗̍̇͂̀͊̿̉̓̇̈́̓͋̍̂̇͜ͅf̴̡̦̻̻͖͈̫͙͎̦̝̟͎̩̼̬̪̤͈̮͕͍̘͛̈́̿̀̂̃͌͆̃̾̌̏́̓̈̊̈́͒͆͐̎͌̍̔̀̉̊͒̾̊͊͋̋̚͠͠͝ͅ ̶̡̢̨̡̛̛̖͕͚̦̻͙̳̮̭͙̼̟̲͓̯̞̻̘͍͕̞̙̻̰̱͎̼̱̫̘͕̭̺̝̥͓̫͙͉̳͖̭̬̻̺̦̱̲̙̙̫̺̺̠͚̜͉̰̤̝̟̟̤͗̾́́̾̍̌͑̈̑̏̈́̈́̃͆̂̓̀̿̉̓̋̒̿̉͑̑̆́̈́͆͛͒̌͋̅͛̃̌̒͒̑̽̈́̅͗̽͋̅͑̔̎̎̈́͐̑̓͑͊̚͘̕̕͜͝͝͝ͅÿ̵̧̧̢̰͙̩͈̼̻̠͕̞̤̯͖̪̫͔̘̞̰̗͔̟͙̻̦̬̱̺̘̹̙̯̯͖͇͙̘̻͈̯̪̠̱̗͇̘̟͈̫̗͈͙́̐̈̏̇̈́̆̔͐̑͗́͛̃̑̕͜ͅͅơ̴̗̻̱͓̦̮͙̻̘͓̻̏̓̿͑͗́͂͊͗͌͌̓̀̈́̆̃̇͐͊̋̏̓̓̑͆̊͌̆̔̈́̂͑̊̈̀̎̈̒͑͛̔̏̈́̽͑̎̽͒̀͌͆̓̀̔̆̉̆̊͆̽͑͒͒̕͝͝͝͝͝ư̸̡̨̢̧̡̛̹̙̯͙͎͖̹̗̜̤̯̯̬̬̫͈̖͙̬̖͓̗̹̱̟͎̰̗͓͔̠͎̲̝̳͓̺̯̙͖̼̦̹̲͖͉̈͛̉͒͒̂͛̀͂̈́̓̿͋͂̍͋̈́̍̉̑͐̾̀̉̑͐̍̌̿̌̂́̐̽͐͑̿̓́̕͘̚͘̕͜͜͜͝ͅ ̵̨̡̢̨̦͕̳̠̻͓̞̱͇͓͇̺̖̦̤͔̙͈̫̺̣̤̹̲̣͎͉̗̳̜̬͉̩̗̲͇̣͐͊̓̈́̎̊͆̀͋̐̽̾̃̃͑̒͌̀͌̀͐̊̃̈̂̅̐̀̒̉̋͌͊͊̽̇̉̒̍̍͗͛̈͘͜ͅṡ̶̨̧̡̛͈͔͙͎̜͓̦̺͙͎̝̱͈̬͖̯͓̠̟̫͕̰̗̹͌̈̈̍̆ͅư̷̢̧̧̹͎͔͈͔̤̠̬͕̖͙̦̝͉̻͓͇͖͚͉͖̝̻̺̜͙̺̲̟͔̯͈̰͈͓̲̰͓͉̱̙̘͈̺̯̗̮̌̾̈͐̓͂̒͊̊́̓̿̈́̈́̓̏́̔͐́̀̉̿̏͋̀̋̈͒́͌̈̈́̈́͊̍̃͋̂̋̄̈́̓̌͒̋̇̅̿̓̌́̉͂̔̌͛̚͝͝͝͝͠͝ͅͅͅb̶̡̢̢̛̛̘͚͔̣̙̦͚̖̦̙̙̭̙͚̘̫̳̦̀̉̑̽̂̉͊͛͋̊͐̇̿̅̈́̾́̽́͋̈́̍̾̿̀̃́͂͒̍̽̆͊͒̋͌̑̋̒̇͌̅͆́̕̕͜͜͠͝͝ͅş̵̧̢̡̧̧̧̧̛̱͈̤̪͈͔̝̣̹͎̜͓̥͙̣̩̯͚̳̭͍̪͇̳̣̩̱̳̝͉͉̖̳̝̞̮̀͊̈͐́͊̒̈́̀̑̓͋̎̈́̅̀͛̈́̿͋̀̊̓̕͘͝͝͠ẗ̷̨̡̢̡̧̧̧̢̢̡̛͈̳͖͎̩͕̯̝͇̖̫̰̲̤̖͓̲̦̱̣̼͚͚͖͕̤̯͚͉͕̙̮͇̫͕̤̱̺̤̪͎͕̜͇́̾̾͆̈́̍̔̌͗̐͛̓̎͋̂̆͑͛̏̔̓̃̍͗͋̓̒͒̔̊̅͂͋͑̑̾̆̍͊̂͆́̎́͘͠ͅͅͅã̴̡̨̧̡̧̧̡̧̢̡̢̛̤͓̠̣̭͔͈͇͍͕̼̤̹̦͔̥̘̟̭̯̜͕̬͔̮̺̝͙̙͕̣̤̩̬̜̺̙͍̝̖̭͕͓̞̗̻͎͈̗̝̣̺͒̃̅͐͗̎̀̃͊̒̔̍͂̍̒̇̐͗̿͛̈́̆̄͘̚͘̕͠͠ͅn̷̬̼̻̤̟̣̯̮͕̜̭̟͎̱͓̝͉̝̦̜̣͙̜͉͉̼͉͕̱̭͔̠̠̤̝̣̞͈̗̘̩͈͎͍͂͋̾́́̋̽͂̅̿̍̓͛̊́̓̍̿͛̅͂̽̓̿͌́̔͐̓̓̈́̿̒̽̒̅̎͐̈́̉̊̎̐̈́͛͊̎̈́͗͛̂͆̕̕̚͘̚̚̚͘͜͜͜͝͝͝͝ͅͅt̶̢̡̢̧̢̛̮̮̞̦͓͉̣͉̜̱̪͖̫͙̳̗̜̜̰̯̥̟̰͉̖͚̞̟̳̬̩͕̫͈͍̺̘̦̠͉̱̠̱̩̲̯̣͕̩̱̟̙̥̙̥͉̭̦̖͙̣͔̙̳̫̺̱̒͛̂̈́̈͒͗̈́͆͗̀̓̆̓̀́͐̀̋̌̃͊̄̇̀̓̑̽̏̄͒̔̐͛͑̑̌̃͆̓͗̏̃͋̇͋̈́̐̓̀͘̚̚͜͠͝͝͝͠i̴̧̡̧̢̜͖̲̜͕͙̤͈̳̼̩̪̗͓̱̰͇̭͉͚̲̮̣͈̠̙̳͔̙͕̤͖͇̮̠̮͕̠̘̣̮̗̗̦͕̘͌́͋́̀̒̋͊̄̃̊̊̂̌͆̅̆͒̉̑̓̃͂̍̑͛̅̚͘̚͝ͅa̴̡̢̨̧̢̧̨̛̛̩̥̘̞̣̞͉͔͓̦̩̰̥̳͎͈̣̯͎̳͔̦̩̻̞̯̣̻̮͓̬̰̞̞̗̜̯͖̠̣̼̻̩̣͎̙̟͍͕͙̹̦̣͉̋͌̓̋̄̐͊͂̾͋͆͛̐̌̅̑͂͌̌̊͑̉̇̌̿̈́͊̕̕̕̕͜͜͜͝ͅͅͅļ̴̢̡̧͔͍̯̑͛̒̎̋̔̃̊̂̏͛͋͒́͊̔̈́̾͗̓̊̓̆͂͊̎̀̕̚͘͝͠l̸̢̢̡͈̭̼̠̮̱̙̺̯̖̤̜̩͚͙̻͇̖̻͑̓̔́̈́̎̅͒̈́̒̌́͌͗̋̀̐̇̓͑͊̇̒̈̓̀̾̉̋̔̍̀́͘͝͝ͅȳ̷̢̧̢̢̧̛̛͔͚͈̪͓͈̤̘͍͚̙͖̗͙̝̰̈͌̀͆́̃̀̉͐̅͘ ̶̡̡̧̧̭̩̟̠͚͙͙͔̺̠̭̞͕͈̬̹͓͉̥̩̖͙̺̻͖̠͉̥̩͉̞̣͉̗̞̝̭̬͔̙͉̬̘̗̝̈̏̒̈́̿͐̋̆̎̀͊̈́͐̍̀̅̑̋͂͛͊̐̓̕̚̚͜͠͝ͅď̶̢̧̧̛̝̖̪̫̲̤̲͇̳̦̜̳̹̻͎͍̫̙̭̰̼͍̝̦̯̭͎͗̀̽̎̿͋̅̈́̉̊̌̃̀̏̌͑̀̈́͗̾̿̂̉͐̌͌͂͗́́̒̒͊̀̈́͂̊̽͋̈̅͆̒̈͒́̒̓̇̀̈̈́̓̚̕͠͝͝͠ȋ̵̡̡̢̢͚̞̜̬͙̤̹̟͖̝̭̘̺̥̬̣͓̦̣̳̙̲̱͚̥̼̼̥̯̞͎̘͙̘̪̲̙̠̭̜̭͓̟̜̭͙̗̖̳̲̬̣̊͊͗̎̒̍̏͆̑̈́̊̈́͐͊̂͒́̓̅͒̎̌́̾̑̽̌̆̽̀́̇͗̽͑̾͐̐̀͐̏̾̚̕̚͝s̶̢̪̙͎̱͚͙͎̤̯̗̤͈̫̲̯̠͙̣̮̖̣̭̭̳̯̼̦̭̩̼͇͙͒̉͂̓̿͛́̊͒̉̈́́̋͒͐̈́̑͋̓̈̇͌̓̔̀̑̍́̓̀̉͊̽̊̀̈̈́̀͛̔̐̀̕͘̕̚͝͝͠͝͝͝ͅt̸̩͖̱̤̬͚̲̟̭̭͍͔̙͎̗̾ṷ̵̡̡̨̤̲̱͙̦̤̮̼̣͈̬̹̥̱͉̮̬̥̪͚͎̲̭̥͚̻̯͑ͅr̶̡̡̧̻̳͕̳͚̱̞̬͈̜̯̺͚̲̣͎͖̳̟̬̟̣̻̖̠͖̭̘̳͉̮̖̙̆ͅͅͅb̸̡̡̧̨̛̛̛̗͚̥̬̝̞͈͎̲̮̱̯͕̝̲̜̳̠̫̟̬̺̜̬̩͖̩̱̠͖̊̐̓́́̈́͗̄̓̽̓́̈́̀̉̇̍̌͌̽̐͋̐͌͛̀̒͑͂̄͊͗̏̓̎̈́̐͋̽̅̌̽̈́̈̽͆́̑̽͑̈́̈́͒̅̓̕͝͠͝ͅͅ ̷̨̧̡̡̧̢̢̘̤̫̞̹͙͖̻̦͈͎̣̟͓̦̬͉̪̫̳̤͕̜͍̥̮̻̖̝̼͖͇͓̭͖̖̼̰̖͍̰̺̥͙̖̻̦̤̲̝̦̜͔̠̜̫́̎̅̆̐̈́̋̋͂͊̈̍̾̎̅̆͒̄̌̂̍̔̇́̌̐̏̐̄̀̌̀̄̕͜͜͜͜͝͠͝͝t̶̡̢̡̢̡̢̛̫̠͈̰̥͓̦͕͇͍̠̬͎̞̤͓̩̯̙͔̝̙̣̣͚͕̪̬͙̺̻̹̮̺̮͎̜̬̞͚̦̮̻̞̬͚̬̘̣̖̠͉̼̭̱͙̞̰̮̳̾̅͛͒̍͒̍̍̃͊͆̔̒̋̓̀̈́́́̏̀̋̍͐̅̔͗̒́̐̂̆̈́̊̎̈̄̿͋̌̈́̃̅͐͘̕͝͠͠͝͠͝͠͝͝ͅh̴̨̧̡̨̛͙̠͉͈̺̦͔͖̮̘̻̝͚̣̳̗̬̦̝̱͍̘̼̥͔̖͙̠̖̹̱̘̦̙̦̭̤̫̥͓̦̯̭͍͙̣͉̞̪͉̩͉̥͈̗̦̩͔̅͆̄͒̉̽̓͆͆̓̇̇̊̆͑͆̇̀̄̐̽͌̾̂͒̇͂̂̾́̄̄̏̉̅͛̏͐͂̏́̚͘͘͜͝͠͠͝͝͝͠͝ͅͅi̴̧̢̢̛̙͎̲̭̫̟̮̠͍̭͕̣͔̹̤͈̜̹̞͕͎̲̪̲̥͈̘̰͙̜̹̼̗̙̰̇̂͐̾̈͑̓́́͌̑͐̐̇͛͐́͛͊͊̑̂̒̈́͊̽̇̋͗͗̈́͒́̈́̅̋̕̚͜͝ͅś̵̨̡̫̱͉̬͉̜̣̯͔̞̘̪̲̹̘͍̭̽͆̒̽̕͝ ̴̛̛͚̪͙͚͖̻͖͈͓͉͙̖͚̺̺͚̬͖̳͓͕͖̜͓̝̞͍̝͙̀̋͋̈́͆̀̀̄́̑̈́̀̌̑̈́̈́̈͋̈͂͊̃́̏̓̈́͆̈́͋̋̽̄͛͋̈́̄̒̂̂̐͊͌͂̃͌͐̀̐̽̇̓͆̆̆̓̕̚͘̚͘͝p̴̡̢̡̮̻͇̦̹̗̤̜͓̼̖͚̺͇̲̙͇͍̻̙͎̥̜̩̜̩̮̳͔̞̜̙̙̬͔͊ĺ̶̨̢̛̛̩̦̩̬̥͙͈̲̩͙͎̩̥͙͓̞̤̭̟͓̦̗̦͖͔̲͕͈̻̫̼͇̬̭̰͇͓̠̱̰̩͕̳̭͙̤̟̦͚̬̺͕̺̭͉͕͌͊̇̏̓̽̿͑̒̂͂͒̓͐͗̈́͂̍͂̈́͊̈́̓́̃̈͒̔̽̉̒͊̄͂͑͜͜͠ͅͅả̶̧̨̨̡̛͙̯̩̤͖̬͔̘̗̥͎̞̗̳̺͙͖̯̻̣͉͓̮͎̲̱̠͔͇̹͚̪̹͕̭̱̰̠͈̥͎̱̳̥̽̅̐̍̃́̀̑͆̑̈́̌̈́̾̇́̔́͌̑́́̈͌͛͗̔͊̋̐̈́͒͆̎͑͂̾̈͗̎̈̑̓̓̿̽͘͘̕c̵̢̨̲̟͎̳̯̫͖͈̞̫̪̱̋͛̒̐͐̌̍̈͐͐̔̾͘̕͘͝ę̷̧̡̧̛̛̛̛̠̭̭͔̭̼̼̠̯̤͔͚̝̭̗̱̦̪̙̻̰̜̟̱̬͇̎͋̐̉̈́͋̔̒̄̆̂̅̒̎̂̃̉͐́̐͐̑́͆͑͑͋͌͒̉̋̐̓͐͐̏̑̂́͛̑̒͗̏̓̄̄͆͗̅̽̕̚͘̕̚͝͠͠͠͝͝͝ ̵̧̧̢̡̡̛͎̹̹̥̭̝̖̱̩̝̖͎͖͚̹͎̝̿͋̋̂̊̂̽̏́͛̾̎̽̐̄̏̇̈̉̊̐̓̊͌͛͒̔̽̾̍̿̊̋̑̿̅͗̅̀̍͘͘͘͝͝ͅp̸̧̨̢̢̢̢̡̢̬͇̮̖̱̺̻̪̳̤̹̥̺͈̫͇̯̠̜̜͎͎͈̤̞͉̟͎͓͓͖͍̙͎̩͉͈͙̻̼̲̙̬̠͔̯͙̖̘̟͚͖͖̤̊͐̔̓́̀̅̋̉̒̒͆͑̊͒̈̓̀̀͂̓̍͐͊̂̍̔̋̒̎͑͂́̌̎̇͗̚͘̕͝͝͝ͅͅͅh̸̢̨̢̢̢̛̥͈̙̳̥̣̟͖̭̗̯̩̫̰̦͖̘͔̣͓̞͈̥͉̪̫͔̝̲̩̠͎̫͈͖̮̙̯́̅̾̅̑͋̏̾̐̾͑͗̋͛̍͑̎͛̔͗̒̍̑̊̋̈́̄̒̽̊̇̋̐̈́͗̒̿̊̈̏̉͊̇̀͛̌̚͘͘͜͠͝͝͝͠͝ͅͅy̶̡̡̨̧̢̥̘͉̙̻̺̫̰̻̹̲͙̭̞̞͕͈̮̬̼̲͍̳͖̻̫̖̞̠͕̼̭̭̠͇̖̻͙̣͕̪̰̘̫̻̗͎̭̫̘̥̺͓̰̑̋͑̉͛̽̒͂͌̓̈́͑̀̊̀̀̅̄̋͆͒̅́͐̎̈̇̇̎̚̕͜͝͝͝s̴̨̛̲̝̰̯̣͓̟̭̰̯̪̟͚̭̙̻̗̞͈̰̹͎̺̰̣͙͍̖̤̮͍̙̹̩̦̆̂͒̐̋̽̓́̀̀͐͗̌̇́̎͊͝í̷̡̨̨̨̧̢̬̲̟̖̜̖͇͙͖̥̦͖͉̤͍̬̜̤̼̗͇̗̘̣̟̼̬͇͓̥͖̹̖̝̯̠̹̮̲̽̐̐̏͆͊̅͜͜ͅĉ̵̛̗̲͓́͑̒͛̈͋͛͛̈́̏̏͆͆̅̉̉́̈́́͂̔̑̽̀̾͊̐̂̈́̌̏̊̈́͂̇̊̚̚̚̕̕̕̚͜͝͠â̶̢̧̧͕͍̗̩̗̫͔̻̯͈͈̰̤̬̠͇̩̥͕̬͉͕̝̯̬͓͍͖̼͓͕̍̉̆̓̾͑̆͗͌͑̿́͐̊́̏̈́̚͘͠͠͝ͅͅl̴̛̦̬̟̠̰̫͚̺̓̋̿͂̓͂̍̐̇́̍́̈́̄̇̾́́̌͑̔̈́̀̅̾͆̈́̄̂̎́̉̋̆͐̇̀̽̓͗̚͘͝͠ļ̴̧̛̤̟̮̹͙͙̪̬̮̙͓͕͉̜͇͉͍̖̫̳̦̣́̆͋̏̓̏͂͐͋͌͂͛̊͒̈̔̓͆̾́͑̌͆̈̆̈́̌̅̆̅̏͌̒́́̐͐̋̀͗̅̿̅͋͑̈́̇͐̀̋͆̈̔̀̏͆̚͝͝͠͠ͅy̴̧̧̡̡̢̢̛̛̛̯̟̤͉̱̬̗͖̤̼̘͈͙̩͙̳̝̤̤̤̰̰͍̗͓̱̞̰̜͇͙̳̪̞̬͚̰̦̹̳̹͓͙̺͈̜̣̤͙̘̳͇̩͖͙̫̰̳̮͓̓̈́̂̽͋̀̏̋̇̆̂̏́̇̓͗̓̆̓̀̑̑̏̈̀̓͑̑̃̏́̓̉̃̈̑̃̈̌̋̄̀͋̄͗̾͑̑̍͒͗̒͆͑͘͘̚͜͜͜͝͝ͅ.̶̧̛͍̠̪͚̠̞͈̣̈́͐̓̋̄́̊̊̇̉̀̋̈̆̄̇͑̍͐̍̆̄̉̓́̂͊̈́̃͘͝ ̸̧̨̢̧̨̛̩͉͍̘̞͇̺̳̮̦̘̼̥̭͎̩̻̬͇͇̖̬͕͓͓͚͕͈͍̪̘̱͈͕̻̟̻͓͍͓̅͂͋̽̽͂͐̈͑̿͜T̶̨̢̢̧̢̢̨̢̯̝̝͇̭͇̯͈͖̲̙̹̮͍̰͙̹̮͇̳̲̗̥͓̗̱̱͕̻̥̮͍̟̬̙̘̝̳̭̗͉̻̫̘͎̈́̇̐͐͑̈́̉̒̏̀̍̋͆͒̊̓́̂̿̈́̐̾̅́̿̑͒̉̅̍̅̈́̌̊̈́̇̿͑̇̿̉̈́̉̓̆̔̎̽͘͘̚͜͠͝ͅͅḩ̶̨̧̡̢̧̢̨̨͙̫̟̻̹̝͈̙̠̹̮̠͇̣̠̟̠͚̬̤͓̠̪̞̰̜͙̭͚͕̳̲̰̬̳̙̺̞̦͔̱͍̤̱͇͈̞̮̻͔͔̙̥̰̭̭̺̙͓̦̭̀̃͐͐͒̉̆̈́̄̒́͗̌̽̑́̀̇̂̍͊̔̽̈̔͑̓̀̾͑̒̓̿͆̂̎͒̓́̆̊͊̃̈́͑̎̒̃͆̓̽̏́̊̚̚̚͘͘͝͝͠͝ͅͅi̵̢̨̡̡̺̙̗̜͉̯̗̞̠͎̖̹̬̪̭͈̬̝͙̻̣͗̓͑̽̓̃́̿̏͛̔̚͜ș̴̡̨̛̛̛̩͕̦̗̯̯̹̠̮̞̐̏̔͌̽͛̃͗͊̑̎̏̎̉͂̉͒̊͌̉̋̀̇͑̅͌͋̽́͐͆̊̈́̏̈́̾̔͠͝͝͝͝ ̵̨̡̡̛̛̩̟̞̭͚̖̣̩͇̬̤̖̦̯̻̰͕͈̹̟̟͖̬̭̻̜͖̃̇͌̏́̐̀̒̅͑͑̀͗̓̉͑͒̈͒̿̑̓́̉͛̀͘͘͝͝͝ͅͅp̸͔̙̲͍͇̗͈̬̈́̃̾̓̃̌̄̄͆̈́̈͐̐͘͠͠ͅͅl̵̢̧̢̧̧̥͙̟̲̻͖͉̳͕̼͈̥̻͕̭̞̣̫͍̪̝̭̬̥̘̘̩̗̠͇͖̻͙͇̳̠̮̥̹̪̻̈́̈̊͑̂͊̔̓̏͆͗͗̋͒̿̎̔̊̾̕̕͜͜͝ͅă̷̡̝̞̺̪͔̥̳͊̅̉͐̾͗͌̄̊̈́͐͊̿͒̍̇̂̄́͑̏̉̿͗͗̔̉̽̀̔̅̃́̂͊̿͒̉͌͗͒̄͂̀̍̈́͆̋͛͗̎́̽͘̕̕̕͘͘̕͠͝͠͠͠c̷̨̢̡̡̨̡͕̻͖̰͍͎̟̦̩̗͇̦̭̻͙̳̺̘̩̬̦̪̖̤̫̙̜̦̻̤̭̝̜̻͕͙̬͎̹̻̙̫̫͇̓̈̉̉͑͗̓̔̂́͐̂͗̊̈̔́̓̄̓̈͆͗͑̑́́͆̈́̐̄̚̚̕͜͠͠ͅͅͅe̷̛̛̝̹̜͚̜̟̘̞͖͖͍̘̥̹͆͗́̈́̐̈̅̇̅̓͒̈̉̃͐̋͗͆͒̓̀̓̃̈̐̀̄͆̆́͛̏͑̔̽͂͗͗̔͂̋͆͒̏̌͆͗̾̅̈́̃͑̀̎̾̾̅̾̄̅̍̈̈́͘͘̕̕͜͝͠͝ ̴̧͕̳̼̭̔̓͝i̶̧̧̛̛̛̭̳̜͕͎̘͓͉͍͖̲͓͕͖͔̗̦̬͋͗̈́̃̑̉̅͋̂͆̒̽̉͋̎̐̄́̒̄̋͑͗̀̑͗͊̾̂͑̊̐͐̌̽̉͌̍͘̚̕͠ş̶̢̧̡̨̧̨̢̩̮̻̹͎͙̖͚̫̖̰͚̯̼̝̤̲͖̩͕͕͙͎͍̥͈̱̥̮͔͎͇͉͕͉͍͕͙̍͌̓̌̇͊̈́̏̄͜͜͜͜͝ ̷̧̧̧̧̧̛̤̠̠̥̙̬̣̯̦͕̟͈̤͖͍͎͍̣͉̭͚̗͖̮̮̣̞͖̻͈̤̰͉̞̞̲͚̜̭͓̭̘̲̬̼͍̹͙̰̻̥̎͂̎̋̈́̐̏̆̉͐̏̿̀̈̈́́̌̋̽͜͜͜͠ͅb̵̢̛̜͍̹͔̗̯̮̬͚̣̳̰̹̗̤̦̗̰̞̻͇̩̝̞͖͔̜̟̲̯̌͊̂̽̏̈́̉͗͋̊̃̒̍̎͗̀̒̇͆̏̾͗͒̔̈̓͐̃̽̆́̕̚ͅͅê̴̢̢̡̧̙̪͓̪̹͇̬͚̫̟͙͍̞͍̼̹̻̤̞̼̙͎̫̩̺͓̘͖͕̞̟̝̫̙͖̹̜̼͉̋̔͜ş̶̡̨̧̡̧̛̛͖͖̘̘͚͔̦̻͉̣͖͓̤̺͍̦̩͚͍̩̫̭̻̫̼̮̝̖͇̣̝͍̦̥̫̳̈́́́͌͂͛̆̔̽̐̽̌̉̒̓̂̐͋̋̀̐͗͑̊͒̽͒͆̈̋̀̑̊͂̑̏̒̏͂͊̚͘̕͝͠͠͝͝͝ͅţ̷̨̡̛̛̪̲̱̜̮̬̖̙̟̱̩͈̩̜̪̪̜̯͇̻̫͚͕̖͉͙̦̫͔͓͎̻̩͚̟̹̙͇͎̬̥̠̥̘͓̲̞̫͍̠̠̼̜̳̜͙̗̱̘̻̻̺͕͑̑̀̓̍̄̑̂́̅͐̇̊̉͗̎͊̏̀͋̎͆̽̈́͒̈̀͋̾̒̔́̑͛̉̆́̇̿̈́̔̇̌̔́̉̽̈́̿́̍͒͑̚̕̕̚̚̚̕̚͘͜͜͝͝͠ ̸̧̛̛̹̪̜̳̲̞̣͖̻̱͓͚̒̑̍̊̅̄̍̐̽̄͐̒̒̏̉̓͗͜͜͝͝s̷̡̢̢̡͍̩̦̹̝̤͉͖͕͍͖͍̬̥̻̲̺͉̜̳̞̻̜̳̮̙͈̟̫̯̜̩̳͎̩̦̗̭̹̪͔̼̣͎̺͐͋̈́͛̌̒̽̿͒̈̍̊̑̾̀̈́̈̀̍́͛͋̾̆̃̇̈́͂̓͂̌͆̎́̀̆̋̄̄̏͂̅̑́͒̄̽̍̅͠ĥ̷̨̡̙̝̹͉̗̘̣͈͇̱̝̹̤̙̌͌͆̌u̶̗̲͕̹̜̖̭̼̱͒̄̿͌͋̿͐̈̐́̽́͒̓̽̾͋̒̂̈́̈̂͂̐̽̐̏̈́n̴̢̧̧̺̞͕̞͔̹̩̖͍̥̘̻͚̤͙͖̂̇̀̂̔̍̾̋̄̀̄͑̑̿́̓͌̈́̉͒͆̍́̾͑̄͋̉́̌͆̿̏͜͠ͅͅn̶̢̨̡̧̧̡̛̻̞̪̱̝̤̳̺̙̻̺͚̯͈̙̣̜͉̠͓̖̥̥̞͉͈̮̟̺̪͙̠̫̩̙͖͔̯͕̪̲̯̦̜͓̱̼̥͉̊̓͗͛̉̒͊̋̅̅̈́̆̅̏͑͊̔͆̔̈̾̂͌̍̅̓̏͛̿̆͊̋͗͐̎̿̋̈̀̍̓̉̆͑̎͒͌̓͐͊̕̕̚̕̕̚̚͜͜͠ͅͅͅę̶̢̡̡̧̛̥̘͖̻̣̰̘̪̥̼̞̗̳̙͚͇̮̤̘̹͖͕̤̙̤̬͎̆͌̆͋̔̓͛͑̀̊̄̎͊̓̓̄̇̄͆̎̎́͗̋̎́́̾́́̈́̔̒̆́̀̓̆̍̐̀̒̃̑̉̅̈̈́͑͊̍̂͛̃̓̊̽̐̊́̐̽̚͘͘̚͜͝d̴̳̜̲̻̱̪͎̗̂̉̀͛͐̃̌̄̌̀͛̐̌́̆̒̇̀̈́̃̈́͌̄̈͛̿̈́̒͌͌͆͂̽̍͛̓̑̽͊̑̌͘̕̚̚͘͝͝͝͝ ̵̨̨̡̡̢̛̭̝̫̲͕͙̹͇̻̹̦̘̣̻͚͎̼̤̹͉̗̙̯̳͔̼͕̗̪͖̞̘̦̯̗͕̘̩͎̙͇̖͈̥̪̅̈́͋̑̒̾͗́̌̈́̾̿̃̀̄͐̓̃͒̄̽͋̐̋̄̎̂́̕̕͜͜͜ͅͅả̵̡̧̛̱͉͙̰̘͈̗̮͍̞̫̠̱̹̥̹̜̖̬̣̬͕̪̰̞̻̫̞̦͍̘̘͉͕͆̋̔̀̔̅̈́̑̔̑́̓͌͑̃̓͆̊̀͆̆̓͒̇̓͑͊̈̒̓͂̅̈̒̽̆̈́̎̂͆͋̐̊̽̈̌̂̒͗͌̕̕̚͜͝͝n̸̢̧̡̡̥͔̜̩͍̘̘̬͔̫̮̲̞͙͚̫̱̘̪̻̭͓̝̼͙̦͓̰͉̖̻͎̭̖̩͖͙̲͉̥̭͇̥͇̣̙̯͙̩̘͉̭̘̺̝̰̳̰̟͖͔̬̗͈̈́̏͊̐́͊͋̇̇̎͗̿̒̾̂̍͆̐͊̉̆͜͜͜͝͝͝ͅd̵̨̧̡̡̧̡̢̡̡̛̲͚͖̙̹͖͖̘͉͉̱̯̩̪͖̹̰̩͎̫̙̠͖̦̳͖͔̣̞̘̫̣̙̟̥̜͙̰͉͇̹̘̩̠̪̦̱͔̈́̿̉̇̃̈́̓͒̑̂̑̿̎̏̄̈́̒̂͊͆̔̋̍͐̈́́̏͂͘̚̚͜͠͝͝ͅ ̸̛̛̻̦̩̜̣͚̂̃͆͛̊͒̏͐̇̋̿̍̒̄͒͒̊̓͊͋̓̍̍̂̈́͗̀̄̾̔̈́͗͋͌́͋͌̏̐̆̾̀͑͛̅͒̊̈́̒͛̔͂̂̾̕̕͘̚͝͝͝͝ļ̷̧̡̢̢̨̛̱̟͕̮̻͇̳̫͇͍̳̼̭̤͎̝̝̝͕̫̝̙̙͚̪͓̲͎̠̞̠̰͈̪͍͙͍̜̟̮̗̬̥̞̲͍̖̰̣̬̮̮̟̗̑̇̑̓̒͒̾̓̄́̍̀̾̈́̒̊́̐̏̽̉̒̀͊̌̓̈́̅͊̊̋̑̈͌͋͘̕͜͝ͅͅè̴̡̡̨̧̡̛̠̰̞͖͔͈̩͉̮̤̼̙̤͇̟̜̣̙̪͖͈̪̥̙̱̗̅̍̆͐͌̇̔́͂̂͒̌̈͊̂̄̈́̊̈̿̈́̅̌͋͌͌̋͒͗̋̾̿̽̏͑͊͆̍̀͌̉̊̇͆̀̓̓͗̅̑͋̅͘͝ͅf̵̡̢̝̭̤̖͚͎̘͈̦͍̫͖̬̜̦͍̘̖͙̭͍̺̰̻͈͙̪̲̟͔̝̠͚͈͇̟̘͚̦̠̰͂̅͛̒͊̇͒̎̍̅́̊̓͒̋͛́̇̋͂̂͘̚͜͜͝͝͝t̴̝̏̅̀̉̐̂̄͂̈̌̈̃̅̋̆̆͗͆̅̇͛̃̊̀͊̀̇̀͆̔́̉̑̉͗̚͠͠ ̶̢̡̧̧̧̧̪͙̭͔̰̬̞͓̞͍̝̮͍̩͉̲̞͉̟̥̦̘̰̜̩̖̭͖͉͓̗̣͕̳͍͈̫͚͕̼̖̭͉͇̎̐̐͊̒̑̏̑̓̐̿͑̊͋͒̆̈̃̂̽͊̑͆̈́̾̍̕͠ứ̸̢̧̡̨̢̛̮̩̩͉̗̲̲̜̱͙̤̥̞̦͉̻̩̣̙̘̦̘̻̟̜͎̯͙̩̝̖̭̝̗͖̺̥̻͇̤̼̼͎̱̯͔̼̳̫̗̜͑̄̂͂̊̌̍́͛͌̿͛̊͆͊̔̀̑̐̿͗̍͒̄͛͒̀̈́́̈́̄̿̿͛͐̂̃̅͛̽̏͌͘̕͜͜͜͜͝͝͝͝͠͝ͅͅñ̶̡̡̢̡͖̥̤͕̱̖͈͇͔̞͓̘̪̟̪͔̥̣̳͎͇͇̠̙̮̼̬̬͙̘̯̭̬̘̣̖̼̩̯̘̲̥̯̦̰̞̹̥͕̤̬̥̱͓̞͒́̀́̐͐̉̓̄̋͐̀͘͘̕̕͘̚͝i̵̧̢̡̨̢̢̛̦̯͎̗̗̰̲̟̝̠̩̱̱͓̥̳̭͉͖̩̟̥̥̣͓̦̥̟͓͚̫̗͎̜̬̘̮̤̳̦̪͇͓̯͈̅͌̋̐͋̿́̂͊͌͂̅̅̿̄̿̐͆̽̀̊̔͐̔̊̌̈̎͆̊̈́͋̂̏̿͌̕̕̚͜͜͜͝͠͝͝ṇ̵̡̛͕͍̖̫̬̫̯̙̥̲̪̘̗͎̭̦͚̖͈̹̥́̈́̍̍͑̃̒̔̔̿̃͐̍̅̆̆̑̚̚h̵̡̡̡̢̡̢̡̛̛̛̛̻̯̹͚̮̞͎̫̬̫͇͓͕̖͈̘̘̰̘͕̤͍͖̪̲̣̳͕̗͈͓̥͎̙͉̦͙̱̖͕̦̲͖͙͔̱̱̳͔̗̝̬̥̝̒͆̓͒̂̒̓͌͊̉͌͑͋̄͊͛̌̀̌̔̌͛͐̐̑͋̽̍̅͑̇̽͑̃̅̽̔̋̅͗́̾̀́̾̔̿̆͌̾̎̓̍̋͆̑̈͂̉̍͘͜͜͜͜͠͠͝͝͝ͅą̷͉̰͖͓͍̪̺̤̰̮̱̤͔̝̅͆̒̑͛̉̀̾̇̓́̉͐͜͜͝ͅb̷̨̢̧̛̥̬̦͚̣͙̼̹̼̦̮̜̖̩̫̻͓̖̦͕̲̲̥̤̊̑͂͑͂̑̓̋͑͆̾͆̓̔̄̌̈́͆̉̄̃̓̏̓̑̂̾̎̿͘̚͜͜͝͝͝ͅỉ̷̢̡̡̡̧̛͇̘͚͙̩̬͔̳̙̬̪̜͕̬̫̺̖̬̹̭̱̥̥̺͚͎̯̣̫͎̋̄͌̈́̄̎̔̑̂͆̊̇̀͆̄͒̃͆̏͂̊̿͠t̴̨̛̛͙͎̪̩͓̗͎̀̒̃͌̑̈́̈͋̐̊̊̋͌̔̀̇͑͛̂̎͊̆͋̉́̎͆͆̋̈́̓͛͐̔̇̚͝͝ͅȩ̵̡̢̧̧̛͎̰͙̹͔̬̼̥̞̭̟̰̹͈̙̖̞̥̠͇̩̰̠͔̞̦̱̤͉̟͋͛͊͂̌̔̆͆̎̐̑̈̑́͛̊̌̇͗̎̓̏̉̚̚͜ͅd̶̢̡̨̖͇͔͈̻̜̳̳̩̬̼͔͓͇̼͚͖͇̞͚̥̲̦͕̦̲͔̫̞͇̱̤̂͋̅.̵̢̦͉̗̹̮̞̬̤̖͖͈̩͍͙͈͉̫̟̠̯͈̗̠͇̠̱̗͓̻͉͔̠́̓͆̄̐͋̊͋̇̉̏̃̌͋͆̀̈̿̋̄͂͊͂̔̓̆̉̎͒͋̀̇͆̉̃̌͒͛̅̌̚̕͝͠͠ͅͅ"
    }

   // Preloading the above images; effect runs on initial render and never again 
    useEffect(() => {
        Object.values(imgURLs).forEach((filename) => {
            new Image().src = filename;
        });
    }, []);

    const [selectedItemName, setSelectedItemName] = useState(null);
    var selectedItemDesc = "Select an item to view its description.";
    const focusedItemName = useRef(null);

    useEffect(() => {
        setSelectedItemName(null);
    }, [currentDir]);

    if (selectedItemName !== null) {
        itemsList = itemsList.map(item => {
            if (item.name == selectedItemName) {
                selectedItemDesc = itemDesc[item.type];
                return {...item, selected: true};
            } else return item;
        });
        focusedItemName.current = null;
    }

    // selects the Item that is clicked
    function itemClicked(e) {
        setSelectedItemName(e.currentTarget.querySelector("p").innerText);
        e.stopPropagation();
    }

    // clears Item selection when the background is clicked and replaces text
    // highlighting with a dotted "focused" box
    function bgClicked() {
        focusedItemName.current = selectedItemName;
        setSelectedItemName(null);
        selectedItemDesc = "Select an item to view its description.";
    }

    // selects the Item that is tabbed to
    function onTab() {
        setSelectedItemName(document.activeElement.querySelector("p").innerText);
    }
    

    return (
        <div className="content-panel-body-outer">
            <div className="content-panel-body">
                <div className="viewport" onClick={bgClicked}>
                    <div className="explorer-description-sidebar">
                        <img className="file-icon" src={imgURLs[currentDir.type]}/>
                        <h2>{dirname}</h2>
                        <img className="bar" src="/images/explorer_description_bar.png" />
                        <h3 aria-hidden={selectedItemName === ""}>{selectedItemName}</h3>
                        <p>{selectedItemDesc}</p>
                    </div>
                    <Scrollbar noScrollX
                        thumbYProps={{
                            renderer: (props) => {
                                const { elementRef, ...restProps } = props;
                                return (<div {...restProps} ref={elementRef} children={
                                    <div className="thumbYInnerDiv"></div>
                                }></div>);
                            },
                        }}
                    >
                        <div className="explorer-items" style={{height: `${Math.ceil(itemsList.length / 5.0) * 114}px`}}>
                            {itemsList.map(item => {
                                let type = item.type;
                                type += item.selected ? "_selected" : "";

                                let classes = item.selected ? "item-selected" : "";
                                classes += focusedItemName.current === item.name ? " item-focused" : "";

                                return <Item
                                            key={item.name}
                                            additionalClassName={classes}
                                            src={imgURLs[type]}
                                            name={item.name}
                                            onClick={itemClicked}
                                            onItemDoubleClick={onItemDoubleClick}
                                            onTab={onTab}
                                        />;
                            })}
                        </div>
                    </Scrollbar>
                </div>
            </div>
        </div>
    );
}