class Node {
    constructor(category, type, name, children) {
        this.category = category;
        this.type = type
        this.name = name;
        this.selected = false;
        this.children = children;
    }
}

export default new Node("My Computer", "", "My Computer", [
    new Node("drive", "Local Disk", "C:", [
        new Node("folder", "File Folder", "projects", [
            new Node("folder", "File Folder", "joonchicken.github.io", [
                new Node("file", "NOTE File", "joonchicken.github.io", []),
                new Node("file", "NOTE File", "about", [])
            ])
        ]),
        new Node("folder", "File Folder", "temp", [
            new Node("file", "NOTE File", "temporary", []),
            new Node("file", "NOTE File", "yes", []),
            new Node("file", "NOTE File", "hello", []),
            new Node("file", "NOTE File", "why")
        ]),
        new Node("folder", "File Folder", "secret", [
            new Node("file", "NOTE File", "fooled", []),
            new Node("file", "NOTE File", "ya", [])
        ]),
        new Node("file", "NOTE File", "remember", []),
        new Node("folder", "File Folder", "lots of folders", [
            new Node("folder", "File Folder", "1", []),
            new Node("folder", "File Folder", "2", []),
            new Node("folder", "File Folder", "3", []),
            new Node("folder", "File Folder", "4", []),
            new Node("folder", "File Folder", "5", []),
            new Node("folder", "File Folder", "6", []),
            new Node("folder", "File Folder", "7", []),
            new Node("folder", "File Folder", "8", []),
            new Node("folder", "File Folder", "9", []),
            new Node("folder", "File Folder", "10", []),
            new Node("folder", "File Folder", "11", []),
            new Node("folder", "File Folder", "12", []),
            new Node("folder", "File Folder", "13", []),
            new Node("folder", "File Folder", "14", []),
            new Node("folder", "File Folder", "15", []),
            new Node("folder", "File Folder", "16", []),
            new Node("folder", "File Folder", "17", []),
            new Node("folder", "File Folder", "18", []),
            new Node("folder", "File Folder", "19", []),
            new Node("folder", "File Folder", "20", []),
            new Node("folder", "File Folder", "21", []),
            new Node("folder", "File Folder", "22", []),
            new Node("folder", "File Folder", "23", []),
            new Node("folder", "File Folder", "24", []),
            new Node("folder", "File Folder", "25", []),
            new Node("folder", "File Folder", "26", []),
            new Node("folder", "File Folder", "27", []),
            new Node("folder", "File Folder", "28", []),
            new Node("folder", "File Folder", "29", []),
            new Node("folder", "File Folder", "30", []),
            new Node("folder", "File Folder", "31", []),
            new Node("folder", "File Folder", "32", []),
            new Node("folder", "File Folder", "33", []),
            new Node("folder", "File Folder", "34", []),

        ]),
        new Node("folder", "File Folder", "do not enter", [
            new Node("folder", "File Folder", "no", [
                new Node("folder", "File Folder", "stop", [
                    new Node("folder", "File Folder", "dont", [
                        new Node("file", "NOTE File", "Beware those among us.note", [])
                    ])
                ])
            ])
        ]),
        new Node("folder", "File Folder", "testing", [
            new Node("folder", "File Folder", "temporary", []),
            new Node("folder", "File Folder", "A very long name", []),
            new Node("folder", "File Folder", "An even longer name for testing", []),
            new Node("folder", "File Folder", "test", [
                new Node("file", "NOTE File", "")
            ])
        ]),
        new Node("folder", "File Folder", ";)", [
            new Node("folder", "File Folder", ":(", [
                new Node("folder", "File Folder", ":D", [
                    new Node("folder", "File Folder", ">:(", [
                        new Node("folder", "File Folder", "(:", [
                            new Node("folder", "File Folder", "T_T", [
                                new Node("folder", "File Folder", ":/", [
                                    new Node("folder", "File Folder", ">:)", [
                                        new Node("folder", "File Folder", "O.O", [
                                            new Node("folder", "File Folder", "(•_•)", [
                                                new Node("folder", "File Folder", "( •_•)>⌐■-■", [
                                                    new Node("folder", "File Folder", "(⌐■_■)", [
                                                        new Node("folder", "File Folder", "ヾ(⌐■_■)ノ♪", [
                                                            new Node("folder", "File Folder", ":o", [
                                                            new Node("folder", "File Folder", ">_<", [
                                                                new Node("folder", "File Folder", "( ͡° ͜ʖ ͡°)", [
                                                                    new Node("folder", "File Folder", "¯\\_(ツ)_/¯", [
                                                                        new Node("folder", "File Folder", "ಠ_ಠ", [
                                                                            new Node("folder", "T̸̢̢͙̜̗̰̩̝̝̤̜̮̥̟̩͎̯͓̺͉̹̖͚̗̦̥̽͑̓̔̈̋͒̏̈́̆͑̈́͜͝h̶͈̥͔̬̖̮̫͎̜̺̺̘̘̥̓͊̀͌̅͂͗͝͠͝͝ȩ̷̛̛͕̖͙͕̪͌͊̊̀͌͛̒͆̈͊̆̄͑̾̍̆͌̔̏͐̾͑͗̌͑̽̓̐͑̓̽̿͌̀͒͗́͘̕̕͘͘͝ ̵̢̧̡̢̧̠͇̱̻̘̰̬̤̪̟̥̗̮͕̫̲̠̦͙̣̳͔̭̗̍͌͒̓͐̅͑̄̐̽̇̏̀̇̇̅̉̉̑̿̍͑̉̀̒̊̍̓́̽̍̎̿̇͆̀̏̋̓͗̍̃̆̓̇͆̃́͋̎͐̈́̀̿̓̚͘̚̚͘̚͜͜͝͠͠d̷͕̺̜̟̱̅̎̀͒̄̾̉͌́͒̓̉́̏̅͒̇͛̐͛̈́̌͌͑́̈́́̋̒́̈̃̍̅̃̊͌̈́̊̋̔͐̈́̏̀̎̎̈̈̌̐̀͆̔̕̚͝͝͠ȧ̷̢̛̙̩̫̹̟͉͕̹̻̱̹̺̫͙̩̩̖̖̞͉̝̖͕̼̰͇̹̝͓̦̙̠̪̮̦̱̣̆͌̒̈́̈̿̈̅́̏̄̌̈́̏͒̐̓̀͑̄̓̀̃̔͛͗͛͛̍̚͜͜͝ͅn̷̡̡̧̛̛̛̛̝̯̼͓͈̫̩͍͇̘̮͓̑̍̆̌͑̾̆͛͌́͆̀̅̑̈́͌̆̈́̀̑͋̋̓͌̾̍̇̉̽̊͛̐͗͋͌̚̚̕͘͜͝͝͝͝g̶̡̧̧̡̧̡̨̡̛̮͖̻̼̪͉͈͓̱̮̪͉̞͔̼̰͓͓̦͔͎̼̱̺̱͉̤̮͍̱͎͕̺̖̱̤̻̜̺̼͉̟̺̫͈̩̮͖̻͓̜̣̘̟͎̜̬̥͉̗̐̓͜͝ͅe̶̡̛̛͚̫̼͔͖̓̋̀̈͆̇̓̅̑̿̐̍̅͗̅́́͊̀̋̽͆͆͒̐̂͒́̓̉͑̄̚͘̚̚͠͝͝ͅr̸̢̨̨̨̡̡̡̢̡̥͇̘̳̤͖̹̼̺͔̗͔̤̜̟̖̼̫̥̱̩͕̮̰̗̩̩͕̩͔͎̻͎̼̞̯͇͙̫̞͉͎͓̤̜̼͇̾͊̀̍̓̊̈͗̀͌͊̄̀͌̓̔̈́̏̉̍̑͋͒̅͆͐͗̀̇̀̓̆̀̔̅͐͂̚͜͠͝͝͝͠͝ͅͅ ̶̛̛̛͍̯̪͔̤̲̻̬̹̭̗̼̀̀̑̉͛̆̌̔͐̾̅͛̽̎̀̿̈́̀̇̾̎̓̒̃͛̓̄̂̐́̆̓̄̏̌͗͘͝͠i̵̢̨̨̧̡̨̛̹̮͍̳̘̝͈̳̭̻̝͓͙̝̞̭̖̻̰̺͎͔̰̝̲̼̗͔̠̺̩̙̠̦̺͖͕̮͈̪̱̟̫̬̰̼̹̭͎̮̫͇̣̰͇̖͎͖̭̻͙̭͑̇͌̒̏̇̋̈̄̿̈́̆̓̔̋̈́̎͒̿͑̓̅͛̾́̆̈̆̋́̓̆̐͂͒̔̓̇́́̂͌̄͑̂͗̆̈́͗̐̈́͆̂͆̒̆́͗́́̃́͘̕͘͝͠͝ͅș̶̡̧̧̢̡̧̡̧̨̨̢̛͍̫̬͎̰̥͉̗̘̙̬̥͙̮̖͙̦̟̞̩͍̳̠͙͎̹͎̭̞̩͖̬̙̼̤̼̥̩͚̖̣͖̫͍͕̹̗̓̈́̾̌̃̍̉͑̋̓̅̾̾́̀̾͛̎͊̚͘̕͜͜͝͝͝͝ͅ ̵̛̛̛̲̒̈́̑̓͐͋̄̎͊̀͌͑͑͐͂̊̀̇̓̍͐͐͌̆̌̈́̓̊̊̋̊͛̽̈́̃̃̃̎̅̑̇̽̐̅̐̔̊́̎́͘͘̚̕̚͝͝͝͝ͅų̷̡̧̡̧̛͕͙̫͚͉̘̭͉̙̯̫̟͇͖̹̫̼͙̱̞̱̰̘̜̠̝̺̠͉͎̠̖̻̊͛̒̈́̄̃̅̀̀̓͛̌̈́̀̂͒̍̾͋̍͌̃̐͗̓̕̚͜͠ͅͅn̶̨̛͖̖̬̘͖͈̻͉̜̦̖̙̔͂͑ļ̶̡̡̧̛̛͔̯̫͉̺͓̺͎̤̦͓͉̯̖̳͖̞̼̠̲̫̯͕̟͕͔̳̺̻̻̬͚͎̲̮̫̣͇̪̤̓̓͋̆͗̈́́̀͛͐̃̽̑̇̄͛̽̃̅̒́̒̎́̏̈̄̆̿̃̌̈́͂̑̊̚̕̚̕͜͠͝͝͝͝ͅͅe̶̡̛̛͕͇͙̙͈̞̣͊̒̔̊̒̄̃̓͑̈́̈̋̀̂̉͛̆̍̐̀́̇̎̀̃́̍̒͒̿͗͘͘͜͠͝͝ͅͅą̷̧̥̩̘͕̞̞̝̻͍͇̳̥̩̯͔̞̘̪̰͖͚̙̼͂̏̔̊̄̎͌̔́͂̓̋̒̑̓̃̾͂̋̑́̾͌͋͐̀̆̈́́̅̊̋̏̽͗̓͌̉͑̂̑̇̕͜͠͠͠ͅş̶̡̡̢̫̭̝͍͔̙͇̪͔͕̲̣̣̺̠̩̟̬̥̝̯̮͈̥̟͙̲̠̗̠̥̘̮͔͕͎͎̟̭̝̰̼͔̠̪̉̾͐̀̎͑̈̿̔̌̏͆͗͐̿͐̈́̋͐̀͆͌̓̃̐͐̍͋̽͋̚͘͜͠͝͝͝͠ḣ̶̢̢̡̡̧̢̭̭͇̥̘̰̺̰̟̜̯̬̗͔̞̯̬͖͖̥̟̞̠̠̠̝̱̪̹̥̝̦͚̬͙̣̣̞͈̺̺͇̝̭͍̘̩͇̫̯̱̘͇͔̻̯̫͜ͅe̴̡̢̨̻͈̭̹̬̦̟̣̩̫̰̫͈̪̖̘̝̺͖̱̲̥̠̫̳̣̿͛̃̽͋̃͑̇̿̔̈́́͊͗͆͋̅́̇̽̽̅̋͛͌̽̓̂͒̉̅̐̋̽̑̈̆͌͆͒̅̀̒͗͂̕̕͠͠͝͝͝ď̵̢̨̢̡̨̧̡̛̛̲̥̤̬̩͇͚̮͕̟̗̣͉͖̘͙͚̘̥͈̯͉̤̣̖̙͙̭̰̬̝̜̻͉̺͎͇̱̤̪͊̈́͗̾̽̃͗́̿̇̊̄͆̾̋͂̇̊͋̄̿̊͋͑̈́̀̀͋̓̆̑̾͂̒̅̓̅̒͆͆̌̅̌̎̏̄̔̓̅͑̌̚̕͜͠͝͝ͅ ̸̨̢̢̢̢̛̛̼͎̞͍̖͉̻͓̟̠̦͇͍̯̰̙̭̩͓͉̥̥͕͍̞̻̣͖͉͙̫͚̥̳̩̫̞̹͙̟̲͚̳̤͕̲̱͉̣͇̳́̿͐̓͑͒̀̀͒͋͗̋͒̈́͐̃̀̒͑͒́̓̉̒̑͗̈̄͒̔͒̈̉̆̐́͌̈̽̌́̎̽́͆̅̉͌̈́̂͌̓̽̐͗̊́̂̈́͘̕͘͘̕͘͘͘͘͜͜͠͝ͅͅǭ̷̡̢͖̲̪̭̩͈͓̰͚̲̳̝͓̝̫̠̫̟͈͉̜̭̲̻͚̙̫̯̜̩̪̤̘͓̺͖̮̈́̆̇͌̋͊́͋̀̍̎̇̀̓̃́̈́͆̃͋͋̃̄̾́͠͠ṅ̷̨̧̨̥̣̩͕̩͓̼̤̫̠̖̣͍̘̼̜̩͓̓̈́̿̌̀̏̂͛̏́͛̾̒͐͗̏͌̑̈̂͋̒̅͑͌̽͋̏͋̍́͆͛̀̈́͊̓̅͆̑̚͘͘͘͘͠͠͝͝͠͠͠l̸̡̡̧̨̡̢̨̡̢̰͙͈̟̫͈̯̦̟̝̠̰̞̫͈̺̦̦̰͓̝̗̦̞̗͇̺̼̮̻͎͈̙̥͉͉͍̠̫͎͕̘̬̹͖̟̼͍̬͔͙̦̖̥͋̽̅̐̄́̇̈́̎͛̊͋̇̒̋̆̂̍̅͊̀̓͌̋͗̄̋͌̍̽̔̋̈́͌̆̌͒̏̈̉̓͒̍̑̔̊̎̒̈̀̒͐̍̐̚̚͜͜͠y̸̢͖͂̇̈́̇̆͌̌͊̆́̉̒͊͋̾̌́͌̃͛͆͋̇̽̊̒̎̀̽̽̽̀̏̓͌̽̐͌͒̾͂͋͐̀͂̿͊̄̀̐̋̅̆̌̒̈́̈̀́̍͘̚͘͝ ̶̡̘̗̯̰͖̱͕̭̺̞̝͔̘̹̖͉͓̞͍̗̳̰̉̈́͆́̎͋̑̌̇͆̑̀̀͛̅̋̃͑̿̾͊͊̆̾͆̈́̈́̿͂̄͛̓̊̑͗͒̄̎́̇̃̎͂͊̀̊̕̕͘͘͜͝͠͝͠͝͝͝ì̴̡̡͖͔͇͎͍̩̫̖͓̼͔͕̣̭̳̖̺̟̰̰̤͉̬̖͈͎͍̮̖̥̖͓̤͓͖͎̭̘̰̜̫̙͚̮͙͓̈́̌͐͗̍̇͂̀͊̿̉̓̇̈́̓͋̍̂̇͜ͅf̴̡̦̻̻͖͈̫͙͎̦̝̟͎̩̼̬̪̤͈̮͕͍̘͛̈́̿̀̂̃͌͆̃̾̌̏́̓̈̊̈́͒͆͐̎͌̍̔̀̉̊͒̾̊͊͋̋̚͠͠͝ͅ ̶̡̢̨̡̛̛̖͕͚̦̻͙̳̮̭͙̼̟̲͓̯̞̻̘͍͕̞̙̻̰̱͎̼̱̫̘͕̭̺̝̥͓̫͙͉̳͖̭̬̻̺̦̱̲̙̙̫̺̺̠͚̜͉̰̤̝̟̟̤͗̾́́̾̍̌͑̈̑̏̈́̈́̃͆̂̓̀̿̉̓̋̒̿̉͑̑̆́̈́͆͛͒̌͋̅͛̃̌̒͒̑̽̈́̅͗̽͋̅͑̔̎̎̈́͐̑̓͑͊̚͘̕̕͜͝͝͝ͅÿ̵̧̧̢̰͙̩͈̼̻̠͕̞̤̯͖̪̫͔̘̞̰̗͔̟͙̻̦̬̱̺̘̹̙̯̯͖͇͙̘̻͈̯̪̠̱̗͇̘̟͈̫̗͈͙́̐̈̏̇̈́̆̔͐̑͗́͛̃̑̕͜ͅͅơ̴̗̻̱͓̦̮͙̻̘͓̻̏̓̿͑͗́͂͊͗͌͌̓̀̈́̆̃̇͐͊̋̏̓̓̑͆̊͌̆̔̈́̂͑̊̈̀̎̈̒͑͛̔̏̈́̽͑̎̽͒̀͌͆̓̀̔̆̉̆̊͆̽͑͒͒̕͝͝͝͝͝ư̸̡̨̢̧̡̛̹̙̯͙͎͖̹̗̜̤̯̯̬̬̫͈̖͙̬̖͓̗̹̱̟͎̰̗͓͔̠͎̲̝̳͓̺̯̙͖̼̦̹̲͖͉̈͛̉͒͒̂͛̀͂̈́̓̿͋͂̍͋̈́̍̉̑͐̾̀̉̑͐̍̌̿̌̂́̐̽͐͑̿̓́̕͘̚͘̕͜͜͜͝ͅ ̵̨̡̢̨̦͕̳̠̻͓̞̱͇͓͇̺̖̦̤͔̙͈̫̺̣̤̹̲̣͎͉̗̳̜̬͉̩̗̲͇̣͐͊̓̈́̎̊͆̀͋̐̽̾̃̃͑̒͌̀͌̀͐̊̃̈̂̅̐̀̒̉̋͌͊͊̽̇̉̒̍̍͗͛̈͘͜ͅṡ̶̨̧̡̛͈͔͙͎̜͓̦̺͙͎̝̱͈̬͖̯͓̠̟̫͕̰̗̹͌̈̈̍̆ͅư̷̢̧̧̹͎͔͈͔̤̠̬͕̖͙̦̝͉̻͓͇͖͚͉͖̝̻̺̜͙̺̲̟͔̯͈̰͈͓̲̰͓͉̱̙̘͈̺̯̗̮̌̾̈͐̓͂̒͊̊́̓̿̈́̈́̓̏́̔͐́̀̉̿̏͋̀̋̈͒́͌̈̈́̈́͊̍̃͋̂̋̄̈́̓̌͒̋̇̅̿̓̌́̉͂̔̌͛̚͝͝͝͝͠͝ͅͅͅb̶̡̢̢̛̛̘͚͔̣̙̦͚̖̦̙̙̭̙͚̘̫̳̦̀̉̑̽̂̉͊͛͋̊͐̇̿̅̈́̾́̽́͋̈́̍̾̿̀̃́͂͒̍̽̆͊͒̋͌̑̋̒̇͌̅͆́̕̕͜͜͠͝͝ͅş̵̧̢̡̧̧̧̧̛̱͈̤̪͈͔̝̣̹͎̜͓̥͙̣̩̯͚̳̭͍̪͇̳̣̩̱̳̝͉͉̖̳̝̞̮̀͊̈͐́͊̒̈́̀̑̓͋̎̈́̅̀͛̈́̿͋̀̊̓̕͘͝͝͠ẗ̷̨̡̢̡̧̧̧̢̢̡̛͈̳͖͎̩͕̯̝͇̖̫̰̲̤̖͓̲̦̱̣̼͚͚͖͕̤̯͚͉͕̙̮͇̫͕̤̱̺̤̪͎͕̜͇́̾̾͆̈́̍̔̌͗̐͛̓̎͋̂̆͑͛̏̔̓̃̍͗͋̓̒͒̔̊̅͂͋͑̑̾̆̍͊̂͆́̎́͘͠ͅͅͅã̴̡̨̧̡̧̧̡̧̢̡̢̛̤͓̠̣̭͔͈͇͍͕̼̤̹̦͔̥̘̟̭̯̜͕̬͔̮̺̝͙̙͕̣̤̩̬̜̺̙͍̝̖̭͕͓̞̗̻͎͈̗̝̣̺͒̃̅͐͗̎̀̃͊̒̔̍͂̍̒̇̐͗̿͛̈́̆̄͘̚͘̕͠͠ͅn̷̬̼̻̤̟̣̯̮͕̜̭̟͎̱͓̝͉̝̦̜̣͙̜͉͉̼͉͕̱̭͔̠̠̤̝̣̞͈̗̘̩͈͎͍͂͋̾́́̋̽͂̅̿̍̓͛̊́̓̍̿͛̅͂̽̓̿͌́̔͐̓̓̈́̿̒̽̒̅̎͐̈́̉̊̎̐̈́͛͊̎̈́͗͛̂͆̕̕̚͘̚̚̚͘͜͜͜͝͝͝͝ͅͅt̶̢̡̢̧̢̛̮̮̞̦͓͉̣͉̜̱̪͖̫͙̳̗̜̜̰̯̥̟̰͉̖͚̞̟̳̬̩͕̫͈͍̺̘̦̠͉̱̠̱̩̲̯̣͕̩̱̟̙̥̙̥͉̭̦̖͙̣͔̙̳̫̺̱̒͛̂̈́̈͒͗̈́͆͗̀̓̆̓̀́͐̀̋̌̃͊̄̇̀̓̑̽̏̄͒̔̐͛͑̑̌̃͆̓͗̏̃͋̇͋̈́̐̓̀͘̚̚͜͠͝͝͝͠i̴̧̡̧̢̜͖̲̜͕͙̤͈̳̼̩̪̗͓̱̰͇̭͉͚̲̮̣͈̠̙̳͔̙͕̤͖͇̮̠̮͕̠̘̣̮̗̗̦͕̘͌́͋́̀̒̋͊̄̃̊̊̂̌͆̅̆͒̉̑̓̃͂̍̑͛̅̚͘̚͝ͅa̴̡̢̨̧̢̧̨̛̛̩̥̘̞̣̞͉͔͓̦̩̰̥̳͎͈̣̯͎̳͔̦̩̻̞̯̣̻̮͓̬̰̞̞̗̜̯͖̠̣̼̻̩̣͎̙̟͍͕͙̹̦̣͉̋͌̓̋̄̐͊͂̾͋͆͛̐̌̅̑͂͌̌̊͑̉̇̌̿̈́͊̕̕̕̕͜͜͜͝ͅͅͅļ̴̢̡̧͔͍̯̑͛̒̎̋̔̃̊̂̏͛͋͒́͊̔̈́̾͗̓̊̓̆͂͊̎̀̕̚͘͝͠l̸̢̢̡͈̭̼̠̮̱̙̺̯̖̤̜̩͚͙̻͇̖̻͑̓̔́̈́̎̅͒̈́̒̌́͌͗̋̀̐̇̓͑͊̇̒̈̓̀̾̉̋̔̍̀́͘͝͝ͅȳ̷̢̧̢̢̧̛̛͔͚͈̪͓͈̤̘͍͚̙͖̗͙̝̰̈͌̀͆́̃̀̉͐̅͘ ̶̡̡̧̧̭̩̟̠͚͙͙͔̺̠̭̞͕͈̬̹͓͉̥̩̖͙̺̻͖̠͉̥̩͉̞̣͉̗̞̝̭̬͔̙͉̬̘̗̝̈̏̒̈́̿͐̋̆̎̀͊̈́͐̍̀̅̑̋͂͛͊̐̓̕̚̚͜͠͝ͅď̶̢̧̧̛̝̖̪̫̲̤̲͇̳̦̜̳̹̻͎͍̫̙̭̰̼͍̝̦̯̭͎͗̀̽̎̿͋̅̈́̉̊̌̃̀̏̌͑̀̈́͗̾̿̂̉͐̌͌͂͗́́̒̒͊̀̈́͂̊̽͋̈̅͆̒̈͒́̒̓̇̀̈̈́̓̚̕͠͝͝͠ȋ̵̡̡̢̢͚̞̜̬͙̤̹̟͖̝̭̘̺̥̬̣͓̦̣̳̙̲̱͚̥̼̼̥̯̞͎̘͙̘̪̲̙̠̭̜̭͓̟̜̭͙̗̖̳̲̬̣̊͊͗̎̒̍̏͆̑̈́̊̈́͐͊̂͒́̓̅͒̎̌́̾̑̽̌̆̽̀́̇͗̽͑̾͐̐̀͐̏̾̚̕̚͝s̶̢̪̙͎̱͚͙͎̤̯̗̤͈̫̲̯̠͙̣̮̖̣̭̭̳̯̼̦̭̩̼͇͙͒̉͂̓̿͛́̊͒̉̈́́̋͒͐̈́̑͋̓̈̇͌̓̔̀̑̍́̓̀̉͊̽̊̀̈̈́̀͛̔̐̀̕͘̕̚͝͝͠͝͝͝ͅt̸̩͖̱̤̬͚̲̟̭̭͍͔̙͎̗̾ṷ̵̡̡̨̤̲̱͙̦̤̮̼̣͈̬̹̥̱͉̮̬̥̪͚͎̲̭̥͚̻̯͑ͅr̶̡̡̧̻̳͕̳͚̱̞̬͈̜̯̺͚̲̣͎͖̳̟̬̟̣̻̖̠͖̭̘̳͉̮̖̙̆ͅͅͅb̸̡̡̧̨̛̛̛̗͚̥̬̝̞͈͎̲̮̱̯͕̝̲̜̳̠̫̟̬̺̜̬̩͖̩̱̠͖̊̐̓́́̈́͗̄̓̽̓́̈́̀̉̇̍̌͌̽̐͋̐͌͛̀̒͑͂̄͊͗̏̓̎̈́̐͋̽̅̌̽̈́̈̽͆́̑̽͑̈́̈́͒̅̓̕͝͠͝ͅͅ ̷̨̧̡̡̧̢̢̘̤̫̞̹͙͖̻̦͈͎̣̟͓̦̬͉̪̫̳̤͕̜͍̥̮̻̖̝̼͖͇͓̭͖̖̼̰̖͍̰̺̥͙̖̻̦̤̲̝̦̜͔̠̜̫́̎̅̆̐̈́̋̋͂͊̈̍̾̎̅̆͒̄̌̂̍̔̇́̌̐̏̐̄̀̌̀̄̕͜͜͜͜͝͠͝͝t̶̡̢̡̢̡̢̛̫̠͈̰̥͓̦͕͇͍̠̬͎̞̤͓̩̯̙͔̝̙̣̣͚͕̪̬͙̺̻̹̮̺̮͎̜̬̞͚̦̮̻̞̬͚̬̘̣̖̠͉̼̭̱͙̞̰̮̳̾̅͛͒̍͒̍̍̃͊͆̔̒̋̓̀̈́́́̏̀̋̍͐̅̔͗̒́̐̂̆̈́̊̎̈̄̿͋̌̈́̃̅͐͘̕͝͠͠͝͠͝͠͝͝ͅh̴̨̧̡̨̛͙̠͉͈̺̦͔͖̮̘̻̝͚̣̳̗̬̦̝̱͍̘̼̥͔̖͙̠̖̹̱̘̦̙̦̭̤̫̥͓̦̯̭͍͙̣͉̞̪͉̩͉̥͈̗̦̩͔̅͆̄͒̉̽̓͆͆̓̇̇̊̆͑͆̇̀̄̐̽͌̾̂͒̇͂̂̾́̄̄̏̉̅͛̏͐͂̏́̚͘͘͜͝͠͠͝͝͝͠͝ͅͅi̴̧̢̢̛̙͎̲̭̫̟̮̠͍̭͕̣͔̹̤͈̜̹̞͕͎̲̪̲̥͈̘̰͙̜̹̼̗̙̰̇̂͐̾̈͑̓́́͌̑͐̐̇͛͐́͛͊͊̑̂̒̈́͊̽̇̋͗͗̈́͒́̈́̅̋̕̚͜͝ͅś̵̨̡̫̱͉̬͉̜̣̯͔̞̘̪̲̹̘͍̭̽͆̒̽̕͝ ̴̛̛͚̪͙͚͖̻͖͈͓͉͙̖͚̺̺͚̬͖̳͓͕͖̜͓̝̞͍̝͙̀̋͋̈́͆̀̀̄́̑̈́̀̌̑̈́̈́̈͋̈͂͊̃́̏̓̈́͆̈́͋̋̽̄͛͋̈́̄̒̂̂̐͊͌͂̃͌͐̀̐̽̇̓͆̆̆̓̕̚͘̚͘͝p̴̡̢̡̮̻͇̦̹̗̤̜͓̼̖͚̺͇̲̙͇͍̻̙͎̥̜̩̜̩̮̳͔̞̜̙̙̬͔͊ĺ̶̨̢̛̛̩̦̩̬̥͙͈̲̩͙͎̩̥͙͓̞̤̭̟͓̦̗̦͖͔̲͕͈̻̫̼͇̬̭̰͇͓̠̱̰̩͕̳̭͙̤̟̦͚̬̺͕̺̭͉͕͌͊̇̏̓̽̿͑̒̂͂͒̓͐͗̈́͂̍͂̈́͊̈́̓́̃̈͒̔̽̉̒͊̄͂͑͜͜͠ͅͅả̶̧̨̨̡̛͙̯̩̤͖̬͔̘̗̥͎̞̗̳̺͙͖̯̻̣͉͓̮͎̲̱̠͔͇̹͚̪̹͕̭̱̰̠͈̥͎̱̳̥̽̅̐̍̃́̀̑͆̑̈́̌̈́̾̇́̔́͌̑́́̈͌͛͗̔͊̋̐̈́͒͆̎͑͂̾̈͗̎̈̑̓̓̿̽͘͘̕c̵̢̨̲̟͎̳̯̫͖͈̞̫̪̱̋͛̒̐͐̌̍̈͐͐̔̾͘̕͘͝ę̷̧̡̧̛̛̛̛̠̭̭͔̭̼̼̠̯̤͔͚̝̭̗̱̦̪̙̻̰̜̟̱̬͇̎͋̐̉̈́͋̔̒̄̆̂̅̒̎̂̃̉͐́̐͐̑́͆͑͑͋͌͒̉̋̐̓͐͐̏̑̂́͛̑̒͗̏̓̄̄͆͗̅̽̕̚͘̕̚͝͠͠͠͝͝͝ ̵̧̧̢̡̡̛͎̹̹̥̭̝̖̱̩̝̖͎͖͚̹͎̝̿͋̋̂̊̂̽̏́͛̾̎̽̐̄̏̇̈̉̊̐̓̊͌͛͒̔̽̾̍̿̊̋̑̿̅͗̅̀̍͘͘͘͝͝ͅp̸̧̨̢̢̢̢̡̢̬͇̮̖̱̺̻̪̳̤̹̥̺͈̫͇̯̠̜̜͎͎͈̤̞͉̟͎͓͓͖͍̙͎̩͉͈͙̻̼̲̙̬̠͔̯͙̖̘̟͚͖͖̤̊͐̔̓́̀̅̋̉̒̒͆͑̊͒̈̓̀̀͂̓̍͐͊̂̍̔̋̒̎͑͂́̌̎̇͗̚͘̕͝͝͝ͅͅͅh̸̢̨̢̢̢̛̥͈̙̳̥̣̟͖̭̗̯̩̫̰̦͖̘͔̣͓̞͈̥͉̪̫͔̝̲̩̠͎̫͈͖̮̙̯́̅̾̅̑͋̏̾̐̾͑͗̋͛̍͑̎͛̔͗̒̍̑̊̋̈́̄̒̽̊̇̋̐̈́͗̒̿̊̈̏̉͊̇̀͛̌̚͘͘͜͠͝͝͝͠͝ͅͅy̶̡̡̨̧̢̥̘͉̙̻̺̫̰̻̹̲͙̭̞̞͕͈̮̬̼̲͍̳͖̻̫̖̞̠͕̼̭̭̠͇̖̻͙̣͕̪̰̘̫̻̗͎̭̫̘̥̺͓̰̑̋͑̉͛̽̒͂͌̓̈́͑̀̊̀̀̅̄̋͆͒̅́͐̎̈̇̇̎̚̕͜͝͝͝s̴̨̛̲̝̰̯̣͓̟̭̰̯̪̟͚̭̙̻̗̞͈̰̹͎̺̰̣͙͍̖̤̮͍̙̹̩̦̆̂͒̐̋̽̓́̀̀͐͗̌̇́̎͊͝í̷̡̨̨̨̧̢̬̲̟̖̜̖͇͙͖̥̦͖͉̤͍̬̜̤̼̗͇̗̘̣̟̼̬͇͓̥͖̹̖̝̯̠̹̮̲̽̐̐̏͆͊̅͜͜ͅĉ̵̛̗̲͓́͑̒͛̈͋͛͛̈́̏̏͆͆̅̉̉́̈́́͂̔̑̽̀̾͊̐̂̈́̌̏̊̈́͂̇̊̚̚̚̕̕̕̚͜͝͠â̶̢̧̧͕͍̗̩̗̫͔̻̯͈͈̰̤̬̠͇̩̥͕̬͉͕̝̯̬͓͍͖̼͓͕̍̉̆̓̾͑̆͗͌͑̿́͐̊́̏̈́̚͘͠͠͝ͅͅl̴̛̦̬̟̠̰̫͚̺̓̋̿͂̓͂̍̐̇́̍́̈́̄̇̾́́̌͑̔̈́̀̅̾͆̈́̄̂̎́̉̋̆͐̇̀̽̓͗̚͘͝͠ļ̴̧̛̤̟̮̹͙͙̪̬̮̙͓͕͉̜͇͉͍̖̫̳̦̣́̆͋̏̓̏͂͐͋͌͂͛̊͒̈̔̓͆̾́͑̌͆̈̆̈́̌̅̆̅̏͌̒́́̐͐̋̀͗̅̿̅͋͑̈́̇͐̀̋͆̈̔̀̏͆̚͝͝͠͠ͅy̴̧̧̡̡̢̢̛̛̛̯̟̤͉̱̬̗͖̤̼̘͈͙̩͙̳̝̤̤̤̰̰͍̗͓̱̞̰̜͇͙̳̪̞̬͚̰̦̹̳̹͓͙̺͈̜̣̤͙̘̳͇̩͖͙̫̰̳̮͓̓̈́̂̽͋̀̏̋̇̆̂̏́̇̓͗̓̆̓̀̑̑̏̈̀̓͑̑̃̏́̓̉̃̈̑̃̈̌̋̄̀͋̄͗̾͑̑̍͒͗̒͆͑͘͘̚͜͜͜͝͝ͅ.̶̧̛͍̠̪͚̠̞͈̣̈́͐̓̋̄́̊̊̇̉̀̋̈̆̄̇͑̍͐̍̆̄̉̓́̂͊̈́̃͘͝ ̸̧̨̢̧̨̛̩͉͍̘̞͇̺̳̮̦̘̼̥̭͎̩̻̬͇͇̖̬͕͓͓͚͕͈͍̪̘̱͈͕̻̟̻͓͍͓̅͂͋̽̽͂͐̈͑̿͜T̶̨̢̢̧̢̢̨̢̯̝̝͇̭͇̯͈͖̲̙̹̮͍̰͙̹̮͇̳̲̗̥͓̗̱̱͕̻̥̮͍̟̬̙̘̝̳̭̗͉̻̫̘͎̈́̇̐͐͑̈́̉̒̏̀̍̋͆͒̊̓́̂̿̈́̐̾̅́̿̑͒̉̅̍̅̈́̌̊̈́̇̿͑̇̿̉̈́̉̓̆̔̎̽͘͘̚͜͠͝ͅͅḩ̶̨̧̡̢̧̢̨̨͙̫̟̻̹̝͈̙̠̹̮̠͇̣̠̟̠͚̬̤͓̠̪̞̰̜͙̭͚͕̳̲̰̬̳̙̺̞̦͔̱͍̤̱͇͈̞̮̻͔͔̙̥̰̭̭̺̙͓̦̭̀̃͐͐͒̉̆̈́̄̒́͗̌̽̑́̀̇̂̍͊̔̽̈̔͑̓̀̾͑̒̓̿͆̂̎͒̓́̆̊͊̃̈́͑̎̒̃͆̓̽̏́̊̚̚̚͘͘͝͝͠͝ͅͅi̵̢̨̡̡̺̙̗̜͉̯̗̞̠͎̖̹̬̪̭͈̬̝͙̻̣͗̓͑̽̓̃́̿̏͛̔̚͜ș̴̡̨̛̛̛̩͕̦̗̯̯̹̠̮̞̐̏̔͌̽͛̃͗͊̑̎̏̎̉͂̉͒̊͌̉̋̀̇͑̅͌͋̽́͐͆̊̈́̏̈́̾̔͠͝͝͝͝ ̵̨̡̡̛̛̩̟̞̭͚̖̣̩͇̬̤̖̦̯̻̰͕͈̹̟̟͖̬̭̻̜͖̃̇͌̏́̐̀̒̅͑͑̀͗̓̉͑͒̈͒̿̑̓́̉͛̀͘͘͝͝͝ͅͅp̸͔̙̲͍͇̗͈̬̈́̃̾̓̃̌̄̄͆̈́̈͐̐͘͠͠ͅͅl̵̢̧̢̧̧̥͙̟̲̻͖͉̳͕̼͈̥̻͕̭̞̣̫͍̪̝̭̬̥̘̘̩̗̠͇͖̻͙͇̳̠̮̥̹̪̻̈́̈̊͑̂͊̔̓̏͆͗͗̋͒̿̎̔̊̾̕̕͜͜͝ͅă̷̡̝̞̺̪͔̥̳͊̅̉͐̾͗͌̄̊̈́͐͊̿͒̍̇̂̄́͑̏̉̿͗͗̔̉̽̀̔̅̃́̂͊̿͒̉͌͗͒̄͂̀̍̈́͆̋͛͗̎́̽͘̕̕̕͘͘̕͠͝͠͠͠c̷̨̢̡̡̨̡͕̻͖̰͍͎̟̦̩̗͇̦̭̻͙̳̺̘̩̬̦̪̖̤̫̙̜̦̻̤̭̝̜̻͕͙̬͎̹̻̙̫̫͇̓̈̉̉͑͗̓̔̂́͐̂͗̊̈̔́̓̄̓̈͆͗͑̑́́͆̈́̐̄̚̚̕͜͠͠ͅͅͅe̷̛̛̝̹̜͚̜̟̘̞͖͖͍̘̥̹͆͗́̈́̐̈̅̇̅̓͒̈̉̃͐̋͗͆͒̓̀̓̃̈̐̀̄͆̆́͛̏͑̔̽͂͗͗̔͂̋͆͒̏̌͆͗̾̅̈́̃͑̀̎̾̾̅̾̄̅̍̈̈́͘͘̕̕͜͝͠͝ ̴̧͕̳̼̭̔̓͝i̶̧̧̛̛̛̭̳̜͕͎̘͓͉͍͖̲͓͕͖͔̗̦̬͋͗̈́̃̑̉̅͋̂͆̒̽̉͋̎̐̄́̒̄̋͑͗̀̑͗͊̾̂͑̊̐͐̌̽̉͌̍͘̚̕͠ş̶̢̧̡̨̧̨̢̩̮̻̹͎͙̖͚̫̖̰͚̯̼̝̤̲͖̩͕͕͙͎͍̥͈̱̥̮͔͎͇͉͕͉͍͕͙̍͌̓̌̇͊̈́̏̄͜͜͜͜͝ ̷̧̧̧̧̧̛̤̠̠̥̙̬̣̯̦͕̟͈̤͖͍͎͍̣͉̭͚̗͖̮̮̣̞͖̻͈̤̰͉̞̞̲͚̜̭͓̭̘̲̬̼͍̹͙̰̻̥̎͂̎̋̈́̐̏̆̉͐̏̿̀̈̈́́̌̋̽͜͜͜͠ͅb̵̢̛̜͍̹͔̗̯̮̬͚̣̳̰̹̗̤̦̗̰̞̻͇̩̝̞͖͔̜̟̲̯̌͊̂̽̏̈́̉͗͋̊̃̒̍̎͗̀̒̇͆̏̾͗͒̔̈̓͐̃̽̆́̕̚ͅͅê̴̢̢̡̧̙̪͓̪̹͇̬͚̫̟͙͍̞͍̼̹̻̤̞̼̙͎̫̩̺͓̘͖͕̞̟̝̫̙͖̹̜̼͉̋̔͜ş̶̡̨̧̡̧̛̛͖͖̘̘͚͔̦̻͉̣͖͓̤̺͍̦̩͚͍̩̫̭̻̫̼̮̝̖͇̣̝͍̦̥̫̳̈́́́͌͂͛̆̔̽̐̽̌̉̒̓̂̐͋̋̀̐͗͑̊͒̽͒͆̈̋̀̑̊͂̑̏̒̏͂͊̚͘̕͝͠͠͝͝͝ͅţ̷̨̡̛̛̪̲̱̜̮̬̖̙̟̱̩͈̩̜̪̪̜̯͇̻̫͚͕̖͉͙̦̫͔͓͎̻̩͚̟̹̙͇͎̬̥̠̥̘͓̲̞̫͍̠̠̼̜̳̜͙̗̱̘̻̻̺͕͑̑̀̓̍̄̑̂́̅͐̇̊̉͗̎͊̏̀͋̎͆̽̈́͒̈̀͋̾̒̔́̑͛̉̆́̇̿̈́̔̇̌̔́̉̽̈́̿́̍͒͑̚̕̕̚̚̚̕̚͘͜͜͝͝͠ ̸̧̛̛̹̪̜̳̲̞̣͖̻̱͓͚̒̑̍̊̅̄̍̐̽̄͐̒̒̏̉̓͗͜͜͝͝s̷̡̢̢̡͍̩̦̹̝̤͉͖͕͍͖͍̬̥̻̲̺͉̜̳̞̻̜̳̮̙͈̟̫̯̜̩̳͎̩̦̗̭̹̪͔̼̣͎̺͐͋̈́͛̌̒̽̿͒̈̍̊̑̾̀̈́̈̀̍́͛͋̾̆̃̇̈́͂̓͂̌͆̎́̀̆̋̄̄̏͂̅̑́͒̄̽̍̅͠ĥ̷̨̡̙̝̹͉̗̘̣͈͇̱̝̹̤̙̌͌͆̌u̶̗̲͕̹̜̖̭̼̱͒̄̿͌͋̿͐̈̐́̽́͒̓̽̾͋̒̂̈́̈̂͂̐̽̐̏̈́n̴̢̧̧̺̞͕̞͔̹̩̖͍̥̘̻͚̤͙͖̂̇̀̂̔̍̾̋̄̀̄͑̑̿́̓͌̈́̉͒͆̍́̾͑̄͋̉́̌͆̿̏͜͠ͅͅn̶̢̨̡̧̧̡̛̻̞̪̱̝̤̳̺̙̻̺͚̯͈̙̣̜͉̠͓̖̥̥̞͉͈̮̟̺̪͙̠̫̩̙͖͔̯͕̪̲̯̦̜͓̱̼̥͉̊̓͗͛̉̒͊̋̅̅̈́̆̅̏͑͊̔͆̔̈̾̂͌̍̅̓̏͛̿̆͊̋͗͐̎̿̋̈̀̍̓̉̆͑̎͒͌̓͐͊̕̕̚̕̕̚̚͜͜͠ͅͅͅę̶̢̡̡̧̛̥̘͖̻̣̰̘̪̥̼̞̗̳̙͚͇̮̤̘̹͖͕̤̙̤̬͎̆͌̆͋̔̓͛͑̀̊̄̎͊̓̓̄̇̄͆̎̎́͗̋̎́́̾́́̈́̔̒̆́̀̓̆̍̐̀̒̃̑̉̅̈̈́͑͊̍̂͛̃̓̊̽̐̊́̐̽̚͘͘̚͜͝d̴̳̜̲̻̱̪͎̗̂̉̀͛͐̃̌̄̌̀͛̐̌́̆̒̇̀̈́̃̈́͌̄̈͛̿̈́̒͌͌͆͂̽̍͛̓̑̽͊̑̌͘̕̚̚͘͝͝͝͝ ̵̨̨̡̡̢̛̭̝̫̲͕͙̹͇̻̹̦̘̣̻͚͎̼̤̹͉̗̙̯̳͔̼͕̗̪͖̞̘̦̯̗͕̘̩͎̙͇̖͈̥̪̅̈́͋̑̒̾͗́̌̈́̾̿̃̀̄͐̓̃͒̄̽͋̐̋̄̎̂́̕̕͜͜͜ͅͅả̵̡̧̛̱͉͙̰̘͈̗̮͍̞̫̠̱̹̥̹̜̖̬̣̬͕̪̰̞̻̫̞̦͍̘̘͉͕͆̋̔̀̔̅̈́̑̔̑́̓͌͑̃̓͆̊̀͆̆̓͒̇̓͑͊̈̒̓͂̅̈̒̽̆̈́̎̂͆͋̐̊̽̈̌̂̒͗͌̕̕̚͜͝͝n̸̢̧̡̡̥͔̜̩͍̘̘̬͔̫̮̲̞͙͚̫̱̘̪̻̭͓̝̼͙̦͓̰͉̖̻͎̭̖̩͖͙̲͉̥̭͇̥͇̣̙̯͙̩̘͉̭̘̺̝̰̳̰̟͖͔̬̗͈̈́̏͊̐́͊͋̇̇̎͗̿̒̾̂̍͆̐͊̉̆͜͜͜͝͝͝ͅd̵̨̧̡̡̧̡̢̡̡̛̲͚͖̙̹͖͖̘͉͉̱̯̩̪͖̹̰̩͎̫̙̠͖̦̳͖͔̣̞̘̫̣̙̟̥̜͙̰͉͇̹̘̩̠̪̦̱͔̈́̿̉̇̃̈́̓͒̑̂̑̿̎̏̄̈́̒̂͊͆̔̋̍͐̈́́̏͂͘̚̚͜͠͝͝ͅ ̸̛̛̻̦̩̜̣͚̂̃͆͛̊͒̏͐̇̋̿̍̒̄͒͒̊̓͊͋̓̍̍̂̈́͗̀̄̾̔̈́͗͋͌́͋͌̏̐̆̾̀͑͛̅͒̊̈́̒͛̔͂̂̾̕̕͘̚͝͝͝͝ļ̷̧̡̢̢̨̛̱̟͕̮̻͇̳̫͇͍̳̼̭̤͎̝̝̝͕̫̝̙̙͚̪͓̲͎̠̞̠̰͈̪͍͙͍̜̟̮̗̬̥̞̲͍̖̰̣̬̮̮̟̗̑̇̑̓̒͒̾̓̄́̍̀̾̈́̒̊́̐̏̽̉̒̀͊̌̓̈́̅͊̊̋̑̈͌͋͘̕͜͝ͅͅè̴̡̡̨̧̡̛̠̰̞͖͔͈̩͉̮̤̼̙̤͇̟̜̣̙̪͖͈̪̥̙̱̗̅̍̆͐͌̇̔́͂̂͒̌̈͊̂̄̈́̊̈̿̈́̅̌͋͌͌̋͒͗̋̾̿̽̏͑͊͆̍̀͌̉̊̇͆̀̓̓͗̅̑͋̅͘͝ͅf̵̡̢̝̭̤̖͚͎̘͈̦͍̫͖̬̜̦͍̘̖͙̭͍̺̰̻͈͙̪̲̟͔̝̠͚͈͇̟̘͚̦̠̰͂̅͛̒͊̇͒̎̍̅́̊̓͒̋͛́̇̋͂̂͘̚͜͜͝͝͝t̴̝̏̅̀̉̐̂̄͂̈̌̈̃̅̋̆̆͗͆̅̇͛̃̊̀͊̀̇̀͆̔́̉̑̉͗̚͠͠ ̶̢̡̧̧̧̧̪͙̭͔̰̬̞͓̞͍̝̮͍̩͉̲̞͉̟̥̦̘̰̜̩̖̭͖͉͓̗̣͕̳͍͈̫͚͕̼̖̭͉͇̎̐̐͊̒̑̏̑̓̐̿͑̊͋͒̆̈̃̂̽͊̑͆̈́̾̍̕͠ứ̸̢̧̡̨̢̛̮̩̩͉̗̲̲̜̱͙̤̥̞̦͉̻̩̣̙̘̦̘̻̟̜͎̯͙̩̝̖̭̝̗͖̺̥̻͇̤̼̼͎̱̯͔̼̳̫̗̜͑̄̂͂̊̌̍́͛͌̿͛̊͆͊̔̀̑̐̿͗̍͒̄͛͒̀̈́́̈́̄̿̿͛͐̂̃̅͛̽̏͌͘̕͜͜͜͜͝͝͝͝͠͝ͅͅñ̶̡̡̢̡͖̥̤͕̱̖͈͇͔̞͓̘̪̟̪͔̥̣̳͎͇͇̠̙̮̼̬̬͙̘̯̭̬̘̣̖̼̩̯̘̲̥̯̦̰̞̹̥͕̤̬̥̱͓̞͒́̀́̐͐̉̓̄̋͐̀͘͘̕̕͘̚͝i̵̧̢̡̨̢̢̛̦̯͎̗̗̰̲̟̝̠̩̱̱͓̥̳̭͉͖̩̟̥̥̣͓̦̥̟͓͚̫̗͎̜̬̘̮̤̳̦̪͇͓̯͈̅͌̋̐͋̿́̂͊͌͂̅̅̿̄̿̐͆̽̀̊̔͐̔̊̌̈̎͆̊̈́͋̂̏̿͌̕̕̚͜͜͜͝͠͝͝ṇ̵̡̛͕͍̖̫̬̫̯̙̥̲̪̘̗͎̭̦͚̖͈̹̥́̈́̍̍͑̃̒̔̔̿̃͐̍̅̆̆̑̚̚h̵̡̡̡̢̡̢̡̛̛̛̛̻̯̹͚̮̞͎̫̬̫͇͓͕̖͈̘̘̰̘͕̤͍͖̪̲̣̳͕̗͈͓̥͎̙͉̦͙̱̖͕̦̲͖͙͔̱̱̳͔̗̝̬̥̝̒͆̓͒̂̒̓͌͊̉͌͑͋̄͊͛̌̀̌̔̌͛͐̐̑͋̽̍̅͑̇̽͑̃̅̽̔̋̅͗́̾̀́̾̔̿̆͌̾̎̓̍̋͆̑̈͂̉̍͘͜͜͜͜͠͠͝͝͝ͅą̷͉̰͖͓͍̪̺̤̰̮̱̤͔̝̅͆̒̑͛̉̀̾̇̓́̉͐͜͜͝ͅb̷̨̢̧̛̥̬̦͚̣͙̼̹̼̦̮̜̖̩̫̻͓̖̦͕̲̲̥̤̊̑͂͑͂̑̓̋͑͆̾͆̓̔̄̌̈́͆̉̄̃̓̏̓̑̂̾̎̿͘̚͜͜͝͝͝ͅỉ̷̢̡̡̡̧̛͇̘͚͙̩̬͔̳̙̬̪̜͕̬̫̺̖̬̹̭̱̥̥̺͚͎̯̣̫͎̋̄͌̈́̄̎̔̑̂͆̊̇̀͆̄͒̃͆̏͂̊̿͠t̴̨̛̛͙͎̪̩͓̗͎̀̒̃͌̑̈́̈͋̐̊̊̋͌̔̀̇͑͛̂̎͊̆͋̉́̎͆͆̋̈́̓͛͐̔̇̚͝͝ͅȩ̵̡̢̧̧̛͎̰͙̹͔̬̼̥̞̭̟̰̹͈̙̖̞̥̠͇̩̰̠͔̞̦̱̤͉̟͋͛͊͂̌̔̆͆̎̐̑̈̑́͛̊̌̇͗̎̓̏̉̚̚͜ͅd̶̢̡̨̖͇͔͈̻̜̳̳̩̬̼͔͓͇̼͚͖͇̞͚̥̲̦͕̦̲͔̫̞͇̱̤̂͋̅.̵̢̦͉̗̹̮̞̬̤̖͖͈̩͍͙͈͉̫̟̠̯͈̗̠͇̠̱̗͓̻͉͔̠́̓͆̄̐͋̊͋̇̉̏̃̌͋͆̀̈̿̋̄͂͊͂̔̓̆̉̎͒͋̀̇͆̉̃̌͒͛̅̌̚̕͝͠͠ͅͅ", "d̴̰̝̩̣̩͇̝̠͕̈̒̃o̵͍̜͙̰̰͎͈̽͌̊̃̊ ̵̢̛̜͍̱̖̔̃̀̄͐͆̋́̇n̴̳̄̀̉̈̏̉͘ö̷̧̨̺̝̠̝̟́͛̇t̵̡̧̗͈̏̀̎̉̑̀͆̓͘̚ ̷̧̩̺͈̬̥̀͗͠p̴̢̘̞̝̟̹͖͊̔̊̏̀͆̐͜͠ŗ̷̖̲̯̰̖̟̪̀̅̂̆̈́͒̐̍̆͠ò̷̘́͘͠͠͝c̶̮̪͗͐̄̀̀e̷̲͉̍͑e̷͔̿̋͑̇͝͝͝d̵͇̳̩͈̋̀͛͒̃͆̚ ̸̪̰͍̩͙͎̪̯̂̂̚ͅf̵͚͙̭͓̬̝̼̠̫̅͒̽̿̓̀̎̈̕ͅṷ̴̻̠̩͍͉̜͚̘́͗̈͗̾̒̓̒͑͝r̴̞̣̥̙͚͓͊̈́͆̕t̴̻̭́͊͂̓̿̾̀̀h̸̥̤̠͈̮͖̲̱̝͖̟̔̀̍͋͑̅e̶̢̜̯͙̘̳̣͇̜͆͐̐ṟ̴̘̞̒̈̈́̆", [
                                                                                new Node("trojan", "Trojan.exe", "ඞ", [])
                                                                                ])
                                                                            ])
                                                                        ])
                                                                    ])
                                                                ])
                                                            ])
                                                        ])
                                                    ])
                                                ])
                                            ])
                                        ])
                                    ])
                                ])
                            ])
                        ])
                    ])
                ])
            ])
        ]),
        new Node("folder", "File Folder", "Users", [
            new Node("folder", "File Folder", "Joon", [
                new Node("folder", "File Folder", "Contacts", []),
                new Node("folder", "File Folder", "Documents", []),
                new Node("folder", "File Folder", "Downloads", []),
                new Node("folder", "File Folder", "Favorites", []),
                new Node("folder", "File Folder", "Music", [])
            ]),
            new Node("folder", "File Folder", "local", [])
        ])
        
    ])
])